{"The left image contains one device with a vertical sliding feature, and the right image contains one device with a horizontal sliding feature.": ["horizontal sliding feature", "vertical sliding feature"], "Each image includes rows of no more than three water bottles of the same height and shape displayed horizontally with space between them.": ["water bottles"], "There are two train cars in total.": [], "A chandelier hanging by a chain is above a table.": ["chandelier hanging"], "All horned animal figures are standing facing rightward, and each image contains just one horned animal form.": ["horned animal figures"], "In at least one image there are at least 100 white tentacles with light purple tips.": [], "Both dogs are outdoors and only one dog is showing its tongue.": [], "In at least one image there is only a single zebra with a closed mouth look straight forward.": ["zebra"], "One of the images shows a spider-like creature next to a blush or beige colored urchin, while the other image shows a pink urchin without the spider creature.": ["beige colored urchin", "pink urchin"], "Each image shows a saxophone with a curved bell in a metallic color, and the keys of each saxophone are the same color as the rest of the instrument.": ["curved bell", "metallic color", "saxophone"], "In at least one image there are two people in a small green boat.": [], "The right image shows several dinosaur shaped balloons hung in a room with a beige sofa and a TV hanging on the wall.": ["beige sofa", "dinosaur shaped balloons"], "In at least one image, a bird is flying.": [], "In one image of each pair, there are several rows of brownish penguins in amidst the black & white adult penguins": ["adult penguins", "brownish penguins"], "At least three dogs are lying down in one of the images.": ["dogs"], "There's at least one dog standing.": [], "All of the perfumes in one of the images are sitting on a tray.": [], "there is a crab standing on the sand with white spots on its back and orange tips on its legs": ["crab"], "One of the images contains at least two water buffalos.": ["water buffalos"], "the toilet paper packaging has a arrow pointing in the 1 o'clock position": ["toilet paper packaging"], "The right image contains exactly two monkeys.": ["monkeys"], "One of the dogs [who are missing a limb] has a man made device to help him overcome the disability.": [], "There is a t least one flute with golden accents on it": ["flute", "golden accents"], "You can see the keyboard to the laptop on the right.": [], "Each image shows only one chimpanzee sitting on the ground.": ["chimpanzee"], "In the left image, there are three pairs of knee pads in total.": ["knee pads"], "Each image contains a single dog, and one image shows a dog with forward-flopped ears gazing slightly rightward.": [], "A yellow helicopter with its tail to the right is in front of mountains in one scene.": ["yellow helicopter"], "A bird is in flight and flying towards the right in one of the images.": [], "The right image contains no more than one gorilla.": ["gorilla"], "One image features a stingray on the ocean floor with its top side of vivid blue dots showing, and the other image features a dark gray stingray with its fin curled revealing white underneath.": ["dark gray stingray", "stingray"], "Exactly one llama is being fed by hand.": ["llama"], "In the left image, a person is lifting a free weight.": [], "There are men and women in the right image.": [], "The truck in the image on the right is on a wet surface.": [], "A single dog is outside alone in one of the images.": [], "In one image there are exactly two dark blue macaws in a tree..": ["dark blue macaws"], "One of the images shows a before and after picture of a restyled bookshelf.": ["restyled bookshelf"], "Each image includes a tri-color guinea pig, and at least one image shows two guinea pigs posed side-by-side.": [], "At least one image shows a canoe with no part touching the water and no water in the scene.": ["canoe"], "The dog in the image on the left is lying down.": [], "There are two combination locks, and no key padlocks.": ["combination locks"], "In the left image, purple lemon tree buds are visible.": ["purple lemon tree buds"], "There are at most 2 dogs.": ["dogs"], "there are two graduation gowns in the image pair": ["graduation gowns", "image pair"], "Three wine bottles with gold foil tops are stacked on a red mat.": ["gold foil tops", "wine bottles"], "The left and right image contains the same number of black container of lotion with one lid sitting vertical.": ["lotion"], "In the right image, an adult gorilla cradles exactly one baby gorilla to its chest, in front of a gorilla in the background.": ["adult gorilla", "baby gorilla"], "One image shows a mashed potato casserole in a rectangular white dish with handles, and a piece of silverware is present.": ["mashed potato casserole", "rectangular white dish", "silverware"], "One image shows two pandas sitting on the ground, and the other image shows one panda on a narrow tree limb.": ["narrow tree limb", "pand"], "The left image contains a human wearing a heavy jacket.": [], "One of the images shows fewer than six penguins.": ["penguins"], "No more than three antelope are visible in the left image.": ["antelope"], "There is food on a table.": [], "There are only two dumbbells, and at least one of them is black.": ["dumbbells"], "In one image, at least one caterpiller is visible on broccoli itself.": ["broccoli", "caterpiller"], "There are no humans visible in either image.": [], "All kneepads are modeled by a human body, and at least one image shows only one kneepad and one bare knee.": ["human body"], "The left image contains one square white pillow with an all-over shaggy texture.": [], "One of the cabinets has a curved top and sits flush on the ground, with no feet.": [], "There are seven or less water bottles total.": ["water bottles"], "A dog has its mouth open and showing its tongue in the rightmost image.": [], "An image shows exactly one fragrance bottle displayed on the right of an upright black box.": ["fragrance bottle", "upright black box"], "The stacks of pillows in both images are colorful throw pillows so none are completely white.": ["colorful throw pillows"], "One image contains three bottles of wine and the other contains one bottle.": [], "In at least one image someone is using a kitchen utensil.": ["kitchen utensil"], "A dog is on a leash.": [], "An image shows an adult dog with upright ears in a reclining pose with front paws extended forward.": ["adult dog", "reclining pose", "upright ears"], "Every single dog is standing; none are sitting.": [], "One image shows a round bowl containing broccoli florets, with an eating utensil at a diagonal over it.": ["broccoli florets", "eating utensil"], "The two dogs' bodies are pointing in opposite directions from each other.": [], "A spoon is with the bowl of mashed potatoes in one image and not in the other.": ["mashed potatoes"], "There are more instruments in the image on the left.": [], "In one of the pictures there is a white dog, a brown dog, and a black dog next to each other, and in the other picture there is at least one black dog.": ["black dog", "brown dog", "white dog"], "A tiny white dog with upright head is nestled on a pale plush fiber surface.": ["plush fiber surface"], "In one of the images, a single firefighter is visible.": [], "One image shows a dog in a bright colored collar gazing to one side, and the other image shows a dog reclining on something soft.": [], "The left image features a blond girl in a pink tank top that covers her midriff standing in front of at least one person and posing with a red dumbbell in each hand, lifted with the elbow forming a right angle.": ["blond girl", "pink tank top"], "Each image contains one dog standing with its body in profile, one of the dogs pictured has an extended non-shaggy tail, and the dogs in the left and right images have bodies turned toward each other.": [], "An image containing just one bird shows the bird peering its head out of a hole in a part of a tree.": [], "The left and right image contains the same number of horses pulling a cart.": ["horses"], "The combined images contain exactly one whole lemon, two wedge shapes, and at least one round slice.": ["lemon", "wedge shapes"], "One image features a forward-angled flat-front bus, the other features a forward angled bus with a non-flat front, and the buses in the left and right images appear to face each other.": ["forward angled bus"], "The right image contains no more than one dead water buffalo.": ["water buffalo"], "There are exactly two llamas.": ["llamas"], "One of the images shows a green bottle of Brut Cologne.": ["Brut Cologne"], "Each of the binders is wide open.": ["binders"], "There is a plastic bottle with a white pump top and red label. There is a hand on top of the pump with the thumb in the front and index finger in top": ["plastic bottle"], "All of the clothes are blue.": [], "There are three panda bears sitting in a row eating grass.": ["panda bears"], "At least one image shows a room with clusters of lights suspended from an exposed beam ceiling over rectangular tables and bright orange chairs.": ["bright orange chairs", "clusters", "exposed beam ceiling", "lights", "rectangular tables"], "A person is modeling gloves in at least one of the images.": ["gloves"], "Each pug is wearing something, and one pug wears a head covering and a neutral garment that wraps around the dog like a shawl.": ["head covering", "neutral garment"], "There is a road in front of the building at the bottom of the picture in the right image.": [], "The right image contains one white dog with its eyes closed, and the left image includes only open-eyed dogs.": [], "There are books stacked flat on the floor next to the bookshelves.": ["bookshelves"], "In the right image, people in purple attire are lined up in front of a temple.": ["temple"], "The sole baboon in the image is eating a piece of fruit": [], "Each image includes at least four flutes displayed vertically, and the right image contains exactly five flutes.": [], "The train in the right image is of the Union Pacific Railroad Company.": ["Union Pacific Railroad Company"], "Each image includes at least one beetle and one brown ball, but the beetle in the left image is standing atop the ball on all its legs.": ["brown ball"], "Both vases feature some greenish and goldish coloring, and the vase on the right has a foot/pedestal-type base.": [], "An image shows a back-turned female in a scene that includes several duck-like birds.": [], "Each image shows a person without a surgical mask holding up a syringe with one hand, but one image features a man and the other features a woman.": ["surgical mask", "syringe"], "One image shows a single white puppy while the other shows three white puppies.": [], "There are at most 3 dogs in the image pair.": ["image pair"], "In one image, penguins form a mostly single-file line of at least five birds, with no more than one person standing behind them.": ["penguins"], "At least one of the dogs in the image on the right is wearing a Santa hat.": ["Santa hat", "dogs"], "Each image includes a straight black instrument, but one image also includes a gold-colored saxophone with curved mouthpiece and bell end.": [], "Each image shows one red-orange dog with open eyes and a closed mouth.": ["closed mouth", "open eyes"], "There are exactly four bottles, one in one image and three in the other.": [], "At least one of the vases is pear-shaped.": [], "An image contains a parrot with a red head.": ["parrot"], "One image contains a trio of black pugs out of costume, and the other image includes no uncostumed dogs and includes at least one dog wearing a fur hood.": ["black pugs", "uncostumed dogs"], "The left image shows exactly two dogs while the right image shows exactly one, and all dogs are photographed outside.": [], "At least one human is spending time with the dogs.": [], "A large white cupcake with multi colored sprinkles is featured": ["large", "multi colored sprinkles", "white cupcake"], "There is an image of a tv sitting on a white tv stand with drawers.": ["drawers"], "Three or more humans are visible.": [], "A skin product in one image is in a short fat beige jar with a brown lid the same width as the jar.": ["lid", "skin product"], "There are more than ten rays in every single image.": [], "Both staircases have vertical post designed railings.": ["vertical post designed railings"], "The animal in the image on the right is standing with its body fully above the surface.": [], "Multiple people are riding in a two wheeled cart pulled along a dirt path by one water buffalo.": ["water buffalo"], "There is at least one image where there are multiple animals surrounding a dead prey animal.": ["dead prey animal"], "Large yellow chandeliers hang from the ceiling inside a book store.": ["andeliers", "book store"], "In at least one image there is at least one painting with half an orange.": [], "There are at least 2 elk climbing in the mountains.": ["elk"], "The nozzles on the left- and right-hand bottles face opposite directions, and one of the bottles has sliced citrus pictured on its front.": [], "In at least one image, penguins with fuzzy brown feathers dominate the row of birds closest to the camera.": ["fuzzy brown feathers", "penguins"], "The right image contains one brown canoe, and the left image includes an empty green canoe displayed upright at an angle.": [], "No less than two people are visible in front of a vending machine": ["vending machine"], "At least one of the dogs is wearing something that covers part of their torso.": [], "Each image shows the exterior of a shop, and one shop features red signage while the other features dark green signage.": [], "In the image to the right, you'll only see one seal.": [], "In at least one image there are three pillows sitting at the top of the bed.": ["pillows"], "In one of the images, the ferret is all white, and in the other image the ferret is a different color.": ["ferret"], "At least one of the dogs has ears that stand up.": [], "Four or fewer television screens are visible.": [], "The fragrance bottles pictured on the left and right share similar shapes, and no glass bottles are rounded in shape.": ["fragrance bottles", "glass bottles"], "The left image contains no more than five bottles.": [], "A single chow is standing on all fours in one of the images.": [], "An image shows multiple rectangular ends of boxes side-by-side, showing different colored makeups.": ["colored makeups"], "The image on the right contains no more than one dog.": [], "The right image contains just one bird, and the left image shows at least one extended hand with a bird on it.": [], "All german shepherds are standing and all dogs have their bodies turned leftward.": ["dogs", "german shepherds"], "A dog is resting its head on something.": [], "There is at least one key near a lock.": [], "One image depicts a single orange jellyfish with downward-trailing tentacles, and the other image includes at least two jellyfish with orange 'caps'.": ["orange jellyfish"], "An image features a collage of three similar skincare products displayed vertically.": ["skincare products"], "There are canada geese in each image and none of them are flying or swimming.": ["canada geese"], "An image shows some type of animal without hooves, surrounded on either side by water buffalos.": ["water buffalos"], "A bird is flying.": [], "there are 3 cell phones in the image, the middle phone has a green alien with antennae ears on the front": ["antennae ears"], "One image contains two bottles displayed side-by-side but not overlapping, and the other image contains a single water bottle with a black loop top.": ["black loop top", "water bottle"], "There are only three canoes and at least one of them holds two people.": ["canoes"], "One image shows a primitive structure with horizontal log construction and a gray textured thatch roof.": ["gray textured thatch roof", "horizontal log construction"], "A spoon is shown with a cola bottle in one of the images.": ["cola bottle", "spoon"], "A baboon has its mouth wide open and showing sharp teeth in the left image.": ["baboon"], "There are no more than 4 locks present.": ["locks"], "In at least on image there is a cloud fish facing forward with with at least 6 circlecular ends of corral arms that are see through.": ["cloud fish", "corral arms"], "At least one of the dogs can be seen standing on a green grassy area.": ["dogs", "green grassy area"], "The left image contains a computer desk near a window, the right image does not.": [], "In at least one image there is a single cart with two wheels.": ["single"], "Each image contains a vertical row of at least three flute-related, horizontal wooden items that are evenly spaced rather than touching.": ["horizontal wooden items"], "Human legs model kneepads in both images, and at least one image contains a single kneepad.": [], "All towels shown are white, and one image includes a stacked trio of rolled towels.": ["rolled towels"], "In at least one image there are four standing zebras.": ["standing zebras"], "At least one of the dogs is wearing a collar.": [], "One image includes closed multi-compartment zipper cases shown in six solid-color options.": [], "Each image contains one white ferret figure, but only one image shows an animal in a snowy scene.": ["white ferret figure"], "One image shows a pair of finger-exposing gloves with a panda face on each glove front, and the other image shows one pair of fir-trimmed hand coverings.": ["panda face"], "At least one image is at night time.": [], "Three blue birds are perched outside.": ["blue birds"], "The left and right image contains the same of mini horses running the same direction.": ["mini horses"], "There is a swimming pool and grassy area.": ["grassy area", "swimming pool"], "there are mashed potatoes on a white plate with gravy and chives on top": ["chives", "gravy", "mashed potatoes"], "In one of the images, meat is present.": [], "The right image contains at least one dog wearing a Santa Claus hat.": ["Santa Claus hat", "dog"], "One image shows a person on the right backing away from a brown llama with its face near the person.": ["brown llama"], "One image in the pair shows one kind of saxophone while the other shows saxophones of all varieties.": ["saxophone"], "Each image shows a rightward-turned non-white man in a suit holding a saxophone, and at least one of the men depicted is playing the instrument he holds.": ["saxophone"], "The image on the left shows at least three differently colored pillows stacked on top of each other, while the image on the right shows exactly one pillow.": [], "One image shows a rectangle of folded dough on a wood board, with finger-tip impressions on one edge of the dough.": ["folded dough", "wood board"], "The left and right image contains a total of ten full beckers.": [], "There are no more than 3 people in the image on the right.": [], "In at least one image there is a woman playing the flute look forward right and behind her is a man in plaid playing a violin.": ["fl", "violin"], "A single puppy sits on a black material in each of the images.": [], "Each image shows a single chow dog, and each dog is standing up on all fours with its body turned leftward.": ["chow dog"], "there is a staircase with a window on the wall and a light hanging from the ceiling": [], "The left and right image contains a total of three rodanice.": ["rodanice"], "There are six zebras standing.": ["zebras"], "The combined images contain five products in various versions, but all with flip-top flat lids.": [], "One image features two hamsters and at least one wheel, and every hamster is in a wheel but not running along its inside, and the other image features a single red-orange hamster.": [], "in one of the images, the man has his hand tucked into the pocket on our left side.": [], "There are two dogs on the left image, and three dogs on the right.": [], "There are fewer than twenty golf balls.": ["golf balls"], "Each image contains a pair of spaniels, and each pair of spaniels includes a black-and-white dog.": [], "Each one has feet pointing outward in opposite directions.": [], "In at least one image there is a pile of at least thirty golf balls.": ["golf balls"], "Two wine glasses filled with red wine sit beside a plate of meat and cheese.": ["cheese", "wine glasses"], "Two baked pizzas each have a plastic spacer placed in the center of the pie, but only one pizza is in a visible box.": ["baked pizzas", "plastic spacer"], "The right image shows one black, white, and brown puppy sitting and facing the camera": ["puppy"], "The right image contains no more than one water buffalo.": ["water buffalo"], "Both trains are going on the same direction.": [], "At least one of the scarves hangs lower than the shirt; you can clearly see it against the pant legs.": ["pant legs", "scarves"], "All pelicans shown have white bodies and wings, and each image includes at least two pelicans.": [], "A man is holding a book in the image on the left.": [], "Each image includes exactly one pair of legs, but the left image shows a black knee pad worn on one knee, and the right image shows light-colored knee pads worn on each knee.": [], "One image contains two black pencil cases, and the other shows one open black case containing a compartment insert.": ["compartment insert", "pencil cases"], "Has atleast one picture with more than one vulture in it": ["vulture"], "One puppy is laying on its back.": ["puppy"], "There is exactly one dog in each photo and the dog on the right is being held with a clearly visible leash.": [], "An image shows an uncapped peachy-pink lipstick with a circle showing the lipstick color in the upper right.": [], "There are more than two vending machines.": ["vending machines"], "The right image features a man standing behind and grasping at least one large white dog, and the combined images show three dogs in the foreground.": [], "An animal is looking at food.": [], "There is a single dog in the right image and it is wearing a red collar.": [], "The right image shows three bottles of beer lined up.": ["beer"], "A single dog in the image on the right is running toward the camera.": [], "One of the images shows a pair of pajamas with attached feet.": ["attached feet", "pajamas"], "A dog is facing to the left side of the frame in both images.": [], "There are two athletic shoes, both facing towards the left.": ["athletic shoes"], "All penguins in one image are actually in contact with the water.": ["penguins"], "There is at least one person wearing a red robe with stripes on the sleeves.": ["red robe"], "the left image is not in glassware": [], "One image shows an anemone with long stringy tendrils, and the other image shows an anemone with a slit 'mouth' in its flat center, surrounded by shorter tapered tendrils.": ["anemone", "long", "rils", "stringy tendrils"], "There are two dogs whose legs are not visible that are looking to the left.": ["dogs"], "There is a total of four cups with handles.": [], "Each image shows one dessert served in a footed glass dish.": ["dessert", "footed glass dish"], "there are two penguins in the image pair": ["image pair", "penguins"], "There are more than 14 penguins.": ["penguins"], "Only one person is seated while reading a book in one of the images.": [], "the gorilla on the right only shows its face looking straight at the camera.": [], "The left image features a water bottle covered in silhouettes and symbols, and the right image features a water bottle with anime-style big-eyed cartoons on it.": ["water bottle"], "The model is displaying the back of a fashion jacket.": ["fashion jacket"], "Each image features a leaping horned animal jumping toward the right, with front legs bent down instead of extended forward.": ["horned animal", "leaping"], "The train in one image is displayed horizontally, and the other image shows one leftward angled trained.": ["leftward angled trained"], "All boats shown are in the water, and an oar with paddles on both ends is shown with each boat.": ["oar"], "A dog and its owner are looking at the dog treats.": [], "There are three colorful balloons floating upward high in the sky.": [], "The left and right image contains the same number flat drums.": ["flat drums"], "The right image contains one dog with their teeth exposed.": [], "Each image contains one dog with closed eyes, and the dog on the left is next to red and white fabric.": ["eyes"], "All of the dogs in both of the images are facing away from the camera.": [], "Wooden bunkbeds and wooden chairs are included in each image of the interior of a yurt.": ["Wooden bunkbeds", "wooden chairs", "yurt"], "An image contains two dingoes.": [], "Each image shows one white dog with an open mouth, but the dog depicted in the left image also has its eyes shut.": [], "Both dogs are sitting.": [], "At least one of the dogs is standing on cement.": [], "All dogs have their bodies turned leftward, and the dog on the right is in an active pose.": [], "One of the images is not shot from above the crab.": [], "One image contains two people side-by-side in the foreground, each with a parrot on their head.": ["parrot"], "The right image shows one fragrance bottle with sculptural flowers on its cap positioned in front of and overlapping its upright hot-pink box.": ["fragrance bottle", "sculptural flowers"], "a dog is sitting and facing the right on a stone surface": ["dog", "stone surface"], "In at least one image, all birds are in flight, and at least one image contains over a half-dozen birds with red and blue feather colors.": [], "Three or fewer goats are visible.": ["goats"], "There are two zip tent canopies.": ["zip tent canopies"], "there is a red wall behind 3 wine bottles with a flower with a flower and bow on the label": ["red wall", "wine bottles"], "Someone is wearing a hat in the left image.": [], "There are exactly two apes in the left image.": ["apes"], "One image shows three or more boxes where the top of the box is visible and lists the color name including \"\"\"\"GINGER\"\"\"\" and \"\"\"\"KRISTEN\"\"\"\".": ["color name"], "An image contains a single elephant, and that elephant has its trunk raised and curled back toward its forehead.": [], "The left image contains two locks and two keys.": ["locks"], "The dog in the image on the left has its head resting on the ground.": ["dog"], "The buildings in both of the images are set up on grassy areas.": ["grassy areas"], "An image features a model in a pink bikini standing with her arms over her head.": ["pink bikini"], "The syringes in both pictures are pointing to the left.": ["syringes"], "The left and right image contains the same number of women in bikinis.": ["bikinis", "women"], "One image shows a diagonally-angled rectangular table with books laid flat on it, and the other image includes at least one rounded white sculptural element in a room with bookshelves on the walls.": ["bookshelves", "sculptural element"], "There is no more than one primate in the right image.": [], "Each image shows one closed pencil case, and one is decorated with flowers while the other shows a comic book type scene.": ["closed pencil case", "comic book type scene"], "A single dog is lying on concrete in the righthand image.": ["righthand image"], "Each image shows the bare framework of a yurt-type building under construction, and the right image shows a ladder under the framework.": [], "The right image contains more warthogs than the left image, and the warthog in the left image is kneeling.": [], "There are more animals in the image on the right.": ["animals"], "The canines are visible.": [], "All dogs are wearing collars, at least half of the dogs are chocolate labs, and at least one image features exactly two dogs posed side-by-side.": ["chocolate labs", "collars"], "All of the cheetahs are eating.": ["cheetahs"], "There are both cans and bottles.": [], "The storage unit on the left is narrower, has at least four rows of shelves with no dividers and is empty, and the storage unit on the right is wider, has some dividers, and contains some items.": ["dividers"], "The left image contains two dogs.": ["dogs"], "In one image, the top rail of bannisters of both sides of stairs curve around in a circular pattern at the bottom of a set of stairs.": ["top rail"], "One of the dogs is on wood.": [], "Two people are standing in front of machines.": [], "In only one of the images, there are assorted beetles in a vending machine.": ["assorted beetles", "vending machine"], "All models shown are adults, and the right image includes a female model wearing bunny ears.": ["adults", "bunny ears", "female model"], "There is an animal laying down in the mud.": [], "Two pandas are eating.": ["pandas"], "The right image contains exactly two wolves.": [], "In one image, a dung beetle is on top of a ball, while a second image shows a dung beetle with its front legs to the ground while its hind legs remain on a ball.": ["dung beetle"], "In at least one image there is a two tone table with a wooden top and six white two toned white chairs.": ["two tone table"], "The left and right image contains the same number of standing zebras.": ["standing zebras"], "The left and right image contains a total of three dogs.": ["dogs"], "Something decorative is placed on top of the shelf in the image on the right.": [], "There is at least one penguin chick visible.": ["penguin chick"], "At most 2 upright trumpet vases shown.": ["upright trumpet vases"], "at least one vending machine has a silver money slot in the image pair": ["image pair", "silver money slot", "vending machine"], "A type of animal is on a roof.": [], "Three or fewer people are shown in total, all near water and each person holding up exactly one crab.": [], "Both images show an animal perched on a rock.": ["animal"], "There is an empty glass.": [], "One image shows a schnauzer reclining on its belly with its head upright and paws extended.": ["schnauzer"], "One image contains only whole, unpeeled lemons, while the other image contains one lemon cut in half, and at least as many unpeeled lemons as the image with only unpeeled lemons.": ["unpeeled lemons"], "None of the dogs in these images are wearing clothing.": ["dogs"], "Each image includes exactly two dogs, which are of similar size and color, and one image features two adult chows with their blue tongues hanging down.": ["adult chows", "dogs"], "We've got more than three birds here.": [], "The image on the left shows two hyenas stalking a warthog.": ["hyenas", "warthog"], "In at least one image, a bowl of food is surrounded by puppies but no adult dogs.": ["puppies"], "Each image appears to contain only zebra-type animals, and in at least one image, the zebras are massed together so its hard to distinguish individual animals.": [], "There are two white cups with handles next to each other.": [], "One room has turquoise-blue bookshelves with square compartments, and the other room shows a head-on light-colored bookcase wall that is completely filled with books.": ["square compartments"], "Every single crab is on a plate, ready to eat.": [], "The left and right image contains the same number of sailboat sailing on the water.": ["sailboat"], "In the image to the right, you can see the person's fingers.": ["fingers"], "A large white dog is sleeping on the floor with his tongue hanging out.": [], "The trains have rows of horizontal stripes on them.": ["horizontal stripes"], "At least some of the window shades are slat blinds.": ["slat blinds", "window shades"], "There are two white ring binders closed.": ["white ring binders"], "There are yellow trucks with yellow plows pushing snow.": [], "The bird on the branch is looking to the left": [], "In one image, there is a lone dog looking straight into the camera.": [], "Both images are top views showing at least six cymbals per image along with multiple cylindrical drums.": ["cymbals", "multiple cylindrical drums"], "There is at least one paper towel holder that is visible without a roll of paper towels on it.": ["paper towel holder"], "There are two dogs touching their muzzles together in one of the images.": ["dogs"], "Both images include a glass of wine near a wine bottle and a bunch of grapes.": ["grapes", "wine bottle"], "The left and right image contains the same number of stingrays with only one touching the sand.": ["stingrays"], "One image depicts two overlapping oranges without leaves, and the other image features some type of vessel next to at least one intact orange.": ["overlapping oranges"], "Left image shows a single jellyfish with a spotted mushroom-look cap and tendrils trailing downward.": ["jellyfish", "single"], "One of the vases is a solid yellow color.": [], "A dog is sitting on the grass in the image on the left.": [], "All chihuahuas are \"\"\"\"wearing\"\"\"\" some attire, one dog has a black-and-white face, and at least one image shows two dogs posed side-by-side.": ["chihuahuas"], "All the cars are facing towards the left.": [], "At least 1 person is wearing colorful graduation robes.": ["graduation robes"], "There are three bowls of dough with only one spatula.": ["spatula"], "The left image contains two men making a roof out of palm tree leaves.": ["palm tree leaves"], "the train engine has stripes wrapping all the way around it": ["train engine"], "In one image there is a blue bear baby wray and in the other is a pack of rolled washcloths.": ["blue bear baby wray", "rolled washcloths"], "In one of the images, a dog is sleeping on their back in a belly up position.": ["belly up position"], "There are three sets of blinds.": ["blinds"], "There are four desserts in the foreground, three in one image and one in the other.": ["desserts"], "In at least one image there are two red pillow on a sofa.": [], "In at least one image there are at least 10 dead white bellied geese laying in the grass.": ["bellied geese"], "One flower arrangement is not in a vase.": ["flower arrangement"], "Two dogs are showing their tongues.": ["dogs"], "There are at least five people": [], "There is a sliver brass saxophone laying on a black table flat facing forward with its black bag behind it .": ["sliver brass saxophone"], "In at least one image there is a full two tier glass bakery display.": ["two tier glass bakery display"], "In at least one image there there is an oval mirror layed on top of a black an white checkered pattern.": ["oval mirror"], "There is exactly one flute.": ["flute"], "The left image contains one dog standing on snow.": [], "One image shows a single bird in flight with spread wings, and the other shows at least one blue-and-yellow bird.": ["single bird", "spread wings"], "At least one bird has it's wings spread.": [], "The left and right image contains a total of four women in bikinis.": ["bikinis", "women"], "A young girl is holding something to feed a long-necked animal wearing a halter on its head.": ["halter"], "One image shows multiple pandas on a structure made of wooden logs, and the other shows two pandas by something that extends from the bottom of the image.": ["multiple", "pandas", "wooden logs"], "In the image on the left, we see exactly two padded items.": ["padded items"], "A baby is lying down with a pug puppy in the right image.": ["pug puppy"], "The left image contains no more than one rodent.": [], "No one is standing in front of the building in the image on the right.": [], "All of the items are room temperature.": [], "An image shows a mostly blue train that is on a long wheeled trailer instead of a track.": [], "One image shows a painting of two oranges and the other shows a painting that has fruit next to a piece of kitchenware.": ["kitchenware"], "The right image features a blue and gold temple with a semi-circle arching over the top and a portrait of a person in a robe at the center of the building.": [], "The left image shows one husky standing in profile with its body facing right and its head turned, and the right image includes at least one black-and-white husky pup.": [], "There are two dogs in the left image and one in the right image.": ["dogs"], "IN at least one image there is a raised floor in the dining room with at least  three tables on the bottom floor.": ["dining room", "raised floor"], "Each image contains one dog, with the one on the left posed with front paws forward, and the dog on the right showing some teeth.": [], "Each image includes an adult schnauzer with light beard standing on grass with its body turned rightward.": ["adult schnauzer", "light beard"], "The left and right image contains the same number of goats standing in oppsite directions.": ["goats", "oppsite directions"], "In one of the images there is only one drum containing 2 drumsticks.": [], "The right image shows wine being poured from a bottle into a wine glass, with wine bottles visible in the background": ["wine glass"], "The right image shows one panda posed on its back with at least one front paw raised and mouth open.": ["panda"], "In one image, a single person in a cap and gown is posing outdoors.": [], "At least one image contains a cut half lemon, but the combined images contain no more than three whole, uncut lemons.": ["uncut"], "In at least one image there are four women in bikinis.": ["bikinis", "women"], "there is a man with a white beard wearing a suit and sitting in a chair outdoors , his dog is with him": [], "There is at least one spoon in the mashed potatoes.": ["mashed potatoes"], "In the right image, hay is visible in a wagon being pulled by a horse.": ["hay"], "Both images contain more than five cell phones.": ["cell phones"], "In at least one image there is chopped broccoli sitting on a plate.": ["chopped broccoli"], "Both cars have black seats on the interior.": [], "There are exactly three dogs and they are standing": ["dogs"], "The combined images include at least one standing adult wild pig and at least one standing baby piglet with distinctive brown and beige striped fur.": ["standing adult wild pig", "standing baby piglet", "striped fur"], "In one of the images, at least one of the red convertibles is parked in front of water with the lights of the city behind it.": ["red convertibles"], "There are more containers of a colorful fluid on the left than on the right.": [], "There are 3 pandas playing on a fort made of wooden tree logs with trees in the back": ["pandas", "wooden tree logs"], "The dog in one of the images is standing outside near a yellow flower pot.": ["dog", "yellow flower pot"], "there is twirling ribbon hanging from a set of 3 ballons": ["ballons", "twirling ribbon"], "One image contains a single laptop open to greater than 90-degrees with its screen visible, and the other image includes a rear-facing laptop open to less than 90-degrees.": [], "There is one hart with its body pointed to the right in the image on the right.": ["hart"], "In at least one image there is a woman in a black hat behind the counter moving a baked item.": [], "The left and right image contains the same number of creme lotions.": ["creme lotions"], "An image shows an L-shaped white sofa with shelving that wraps around it and has a black interior.": ["shelving"], "There three fishes in total swimming near an anemone.": ["anemone"], "At least one boat is not in water.": [], "An image contains exactly three bikini models, all standing, wearing sunglasses and facing forward.": ["bikini models", "sunglasses"], "A cushioned bench sits under a window in the image on the right.": ["cushioned bench"], "There are two dogs in the image pair.": ["dogs", "image pair"], "The right image contains one red convertible vehicle.": ["convertible vehicle"], "One pack of dogs is running directly towards or directly away from the camera.": ["dogs"], "The right image contains one chimpanzee that is exposing its teeth.": ["chimpanzee"], "People in matching uniforms are standing behind a man with a beard in a suit, who is sitting in a barber chair thtt a woman is touching.": ["barber chair"], "At least one turret is cone shaped.": [], "An image shows two side-by-side hamsters in the same container, with only their heads sticking out.": [], "In at least one image there is a black phone with its attendant out and closes from the bottom.": ["black phone"], "In one image there is a lone gorilla that can be seen in the act of a roar with its mouth agape.": ["gorilla"], "Two dogs are lying in the grass in each of the images.": ["dogs"], "One of the images does not include a dog bowl.": ["dog bowl"], "The left image has a vehicle facing the left": [], "An image includes an anemone with white tendrils and a thick red stalk surrounded by something purplish.": ["anemone", "tendrils"], "There are at most 3 sea lions in the image pair.": ["image pair", "sea lions"], "No image contains more than three fragrance bottles, and each image includes at least one squarish bottle.": ["fragrance bottles", "squarish bottle"], "Fingers are touching the keyboards in both images.": [], "There are no more than three dogs.": ["dogs"], "In at least one image there is at least one man sitting in a barber chair getting his head shaved.": ["barber chair"], "An image shows a black french bulldog standing on all fours, and at least one image shows a dog looking up at the camera.": ["black french bulldog"], "The left and right image contains the same number of flat crab.": ["flat crab"], "A  single sprig of herb is on top of a bowl of mashed potatoes.": ["mashed potatoes"], "There are four skunks.": ["sk"], "In one of the images, there is a man with at least one dog.": [], "An image has at least three dingos.": [], "An image shows one hand holding onto uncut dough as the other hands slices narrow strips of the dough with a knife.": ["uncut dough"], "One image features a single puppy who is gazing to the side, and the other image shows a row of at least three gold-furred puppies in sitting poses.": ["sitting poses"], "The images are arranged so that the beetles appear to be heading towards each other.": ["beetles"], "There is a pug dressed in a costume": [], "The right image contains two cheetahs.": ["cheetahs"], "At least one perfume bottle cap has pink flowers.": ["perfume bottle cap"], "One image shows a wall-filling brown bookcase with a wide-screen TV in front of it at the bottom center.": [], "In one of the images, the bookshelves are built under stairs.": ["bookshelves"], "In one of the images, there are two girls wearing caps and gowns.": ["caps", "girls", "gowns"], "The left image shows a dingo standing with its body turned left and its face gazing forward, and the right image shows a standing dingo gazing leftward.": ["dingo"], "The left and right image contains the same number of skunks outside.": [], "There are 2 cars traveling near the mountains.": [], "The left and right images show lips with a similar shape and expression, but one pair of lips is noticeably glossier than the other, and teeth are more visible in the right image.": [], "Each image contains one schnauzer with grayish body fur and lighter fur on its 'beard', and the dog on the left is sitting upright, while the dog on the right is standing on something elevated.": ["grayish body fur", "schnauzer"], "There are two birds in total.": [], "Two people are in a hot air balloon basket.": ["hot air balloon basket"], "In at least one of the images, a dog is dressed in some kind of costume.": [], "In at least one image there is a silver sink tub facing forward, right.": ["silver sink tub"], "There are more pandas in the image on the left.": ["pandas"], "There are two levels of stair with slotted stairs and a metal railing.": ["metal railing", "slotted stairs"], "An image shows a rear-facing bus on the right, with an accident scene to its left and a signal light overhead.": ["accident scene", "signal light"], "The right image contains no more than one white sink with one chrome faucet.": ["chrome faucet"], "All elephants in the foreground are lying with the side of their head on some surface.": ["elephants"], "There is a dog on a pure white background.": [], "Each image includes a sleeping seal, and at least one image shows a seal lying on a type of chair.": ["sleeping seal"], "The left and right image contains a total of two yellow plows.": ["yellow plows"], "The left and right image contains the same number of drums.": [], "One three-tub sink is displayed head-on, and the other is turned at a rightward angle.": [], "Right image shows a yurt exterior, and left image shows the interior with lattice-work around the sides.": ["interior", "yurt exterior"], "Right and left images each contain a forward-facing chihuahua, and both dogs have the same basic coloring.": ["chihuahua"], "At least one person can be seen lying in bed in one image and there is nobody in a bed in the other image.": [], "At least one cheetah is chasing something.": ["cheetah"], "The right image shows a vertical stack of no more than five phones, and the left image includes multiple phones but they are not in a level vertical stack.": [], "In one of the images there are at least five safety pins that are not attached to each other.": ["safety pins"], "There is at least three mittens in the left image.": ["mittens"], "In one image, four bottles of similar size and shape with flat-topped lids are standing upright in a row closest to the camera.": [], "Both images show exteriors, and the left image shows a primitive yurt-type structure with no windows and with gray material around it, while the right shows a structure with a black cap on its peak.": ["gray material"], "One of the animals is drinking from a manmade structure.": [], "In one image, two chimps without toothy expressions are sitting alongside each other, looking downward at fruit that they are touching.": ["chimps"], "One image shows a spaniel in a Santa hat gazing leftward at a tree.": ["Santa hat", "spaniel"], "At least one of the gloves has a company logo on it that includes the color red.": ["company logo"], "There are red crabs on the left and dark (grey?) crabs on the right.": ["red crabs"], "Here we have three dung beetles.": ["dung beetles"], "This is more than two flute.": ["flute"], "One image shows a nursing dog with a litter of brown-and-white puppies.": ["nursing dog"], "The combined images include exactly one dark-haired hyena pup, a pup with lighter fur, and one adult hyena.": [], "there are 3 chimps in the image pair": ["image pair"], "There is no more than one dog in the right image.": [], "The left and right image contains the same number bowls with cooked broccoli.": ["cooked broccoli"], "An adult is standing with children outside a bus in the image on the left.": ["children"], "The name of the lotion in the right image is two words.": ["lotion"], "A melon baller has mashed potato inside of it.": ["mashed potato", "melon baller"], "An image shows a large silver-framed sliding glass door that is open, revealing swivel office chairs around a table on brown carpeting.": ["brown carpeting", "swivel office chairs"], "There are a total of four people in the gym.": [], "A hand is holding up a basset hound in one image, with the hound's front paws draped over the hand.": ["basset hound"], "The combined images include an open zipper case containing at least one pair of scissors and at least one black case.": ["open zipper case"], "An image features something pink and shows a fragrance bottle with a floral illustration on its front.": ["floral illustration", "fragrance bottle"], "Each image contains one guinea pig wearing a costume, and the guinea pig on the left wears an animal-inspired costume.": ["guinea pig"], "An adult cheetah is with a younger cheetah in one of the images.": ["adult cheetah"], "The dog in the left image has a collar and leash.": [], "There are 4 or more people standing with parrots perched on their bodies.": ["parrots"], "A spotted cub is licking a reclining adult wild cat in one image.": ["wild cat"], "Writing can be clearly seen on the sails in the images.": [], "Two wooden flutes are side-by-side and displayed diagonally on a brown surface with Chinese characters on it in one image.": ["Chinese characters", "brown surface", "wooden flutes"], "Exactly one dog is standing.": [], "All dogs are posed on some outdoor structure made of wood and are gazing generally toward the camera.": ["dogs"], "One image from the set does not have any binders.": [], "One of the images shows only a single pelican.": ["pelican"], "A sea spider with slender long jointed legs is next to a light peach-colored anemone in one image.": ["sea spider"], "There is a single dog with a leash on": [], "In the right image, there's an adult male elephant seal with at least one other elephant seal.": ["adult male elephant seal", "elephant seal"], "In the left image, the view through a glass door shows a blue pool behind it.": [], "Each image shows one panda grasping a bamboo stalk and chewing on part of it.": ["bamboo stalk", "panda"], "Each image contains forward-turned llamas with upright heads standing in a row.": [], "One image contains a sofa and pillows in only neutral brownish shades, and the other image includes some blue element.": ["blue element", "neutral brownish shades", "pillows"], "In at least one image tehr is a brown mother dog looking after at least one puppy.": ["brown mother dog"], "The left and right image contains the same number of soap dispensers that sit on the sink.": ["soap dispensers"], "Each image contains one dark gray puppy with upright ears sitting on a fabric surface and facing forward with open eyes.": ["fabric surface", "puppy"], "The left image contains a white dog facing towards the right.": [], "An image shows three red-orange dogs in collars standing on a hill and gazing in the distance.": ["collars"], "At least one stack of six solid-colored towels in graduated sizes has a single woven band along the edge of each towel, without exactly two stripes on the edges of the bands.": ["woven band"], "There are only women in the left image.": ["women"], "The animals in each of the images are spending time with their young.": [], "a single chimp is holding a wooden stick": ["wooden stick"], "There are at least four birds in total.": [], "An image shows at least six faces modeling lipstick, with eyes visible and all images displayed in side-by-side pairs.": ["lipstick"], "The bottle on the left is wide, on the right is cylindrical.": [], "In at least one image there is a single full brown beer bottle.": ["full brown beer bottle"], "The right image contains one dog chewing on a small object.": [], "There are at most four shoes.": [], "The right image features a monkey with long silvery hair and a pink face near large rocks.": ["monkey", "pink face"], "Each image contains just one beagle puppy, who is posed on a draped black cloth.": ["beagle puppy", "draped black"], "There are six cups arranged neatly in a pattern that flows from red to violet.": [], "There are three pillows on the couch on the right.": [], "Both of the shops have a classic barber pole, striped both red and blue.": ["barber pole"], "A piece of green lettuce is in the mouth of a llama who's head is up.": ["llama"], "A dog wearing a red collar is visible.": [], "In one of the images, the cheetahs are not being violent with their future meal - this is because a young cheetah will be taught to deal a killing bite.": [], "There is exactly one crab using another animal for camouflage.": [], "in the left image the primate is drinking water from the pool with its mouth": ["primate"], "The right image features only a saxophone-type instrument, which is displayed at an angle with the mouthpiece at the upper left, and the left image shows a variety of instrument figures, including a saxophone and violin.": ["saxophone", "violin"], "There are at least 2 red machines in the right image.": [], "There are two guinea pigs standing neat to each-other in the image on the left.": ["guinea pigs"], "At least one of the pizzas has not been cut.": ["pizzas"], "Exactly one dog has its mouth open.": [], "The right image contains no more than two gorillas.": ["gorillas"], "There are at least 2 animals in the left image.": ["animals"], "In the left image, a dog appears to be snifing a cupcake with white icing": ["dog"], "The right image contains exactly one red lipstick.": [], "One image shows a silver saxophone with its bell facing the camera, in front of a soft-sided black case with white 'dots' on its edge.": ["silver saxophone"], "One image has only two, blue dumbells and the other image has dumbbells of multiple colors.": [], "Some penguins are swimming in water.": ["penguins"], "The left image shows a panda on top of a panda lying on its back, and the right image shows one panda elevated off the ground on something.": [], "A llama is showing its teeth.": ["llama"], "Shoes are arranged on racks on the wall in the image on the left.": [], "In the right image, at least one hand is reaching over a cement ledge to offer a piece of food to a stingray in a pool.": ["cement ledge", "stingray"], "There are at most 3 birds.": [], "The carts have only single riders on them.": [], "There is at least one human.": [], "In at least one image there is a single dead vulture facing down.": ["single", "vulture"], "There are exactly two visible Pocky vending machines.": ["Pocky vending machines"], "A cartoon cat appears once in each image, and the left image features a cartoon cat posed sitting with face forward and leg to the right.": ["cartoon cat"], "There are hamsters in a hamster wheel.": ["hamster wheel"], "The sink in one of the images is affixed to a brick wall.": ["brick wall"], "Wine is pouring into a glass that stands in front of a wine bottle.": ["wine bottle"], "One dog has its mouth open.": [], "The balls in the image on the right have orange markings on them.": ["markings"], "All of the pictures have at least one dog with a baby.": [], "The dog in the image on the right has its mouth open.": ["dog"], "An image shows two different solid-colored cups with pale interiors and without handles, posed side-by-side.": [], "The left image contains one single stack of binders.": ["binders"], "The left and right image contains the same number of stingrays and only one of their tails showing.": ["stingrays"], "One image shows one plastic-wrapped rectangle containing at least 50 paper rolls, with packs containing less than 20 total rolls stacked on top.": ["paper rolls"], "One image shows the front of a white house with bold dark lines on it forming geometric patterns and a thick gray roof with multiple notches for windows, and the other image also features a gray roof that curves around windows.": ["geometric patterns", "gray roof", "thick gray roof"], "The carriage is being pulled by a single horse in the right image.": ["single horse"], "All images show a sliding glass door with an opening for a dog to pass through, and at least one dog is actively using the doggie door.": ["doggie door", "sliding glass door"], "There are windows behind the band in both images.": [], "The driver of the sled can be seen behind the dogs in both of the images.": ["dogs"], "There are two vending machines in the pair of images.": ["vending machines"], "At least one image shows a gauzy white canopy that drapes the bed from a cone shape suspended from the ceiling.": ["gauzy white canopy"], "There are no more than five penguins.": ["penguins"], "A person can be seen holding more than one puppy.": [], "The sky is visible in one image.": [], "Each image shows a person face-to-face with a dog, and the right image shows a greyish dog standing with front paws on the shoulders of a woman in pants.": [], "One of the dogs is posing kennel club show style.": ["kennel club show style"], "The rings are visible inside at least one of the binders.": ["binders"], "There are at least 2 all white dogs outside.": ["all white dogs"], "One slice is being lifted off the pizza.": [], "Only one image features an inflated-looking pillow with a concave turquoise top, and no image contains more than three pillows.": ["concave turquoise top"], "The combined images show no more than six vultures, and no vultures are gathered around a carcass.": ["carcass", "vultures"], "The right image shows a top view of just one forward-facing purplish crab, and the left image shows the underside of a forward-facing crab that is raising its 'head'.": [], "The images contain dozens of rays viewed from high above.": [], "There are more adult animals in the image on the right.": ["adult animals"], "An image shows a group of safety pins arranged in the shape of a flower.": ["safety pins"], "There are four furry animals.": ["furry animals"], "Both legs wear blue knee wraps in one image.": ["blue knee wraps"], "The animals are both looking to the right.": ["animals"], "Some of the elephants have tusks.": ["elephants"], "The left image contains at least three large white birds.": [], "The left and right image contains the same number purple syringes pointing down and left.": ["purple syringes"], "There are people getting their hair cut in both images.": [], "Each image contains a single dog, and the right image shows a basset hound facing forward with an open mouth showing its tongue.": ["basset hound"], "There is a woman interacting with a cheetah in the center of each image.": ["cheetah", "woman"], "The left image shows a group of three side-by-side water bottles, the right image contains a row of five water bottles, and at least one image features bottles with straws in them.": ["straws", "water bottles"], "These pillows all have a striped element in their decorations.": ["pillows", "striped element"], "In one of the images, there is a living creature on top of a roof.": [], "A perfume stands next to its corresponding box in one of the images.": ["perfume"], "In the left image, the cocker spaniel is clearly outside; you don't have to guess.": ["cocker spaniel"], "The right image contains a single decorated round cake.": [], "The right image shows an open-mouthed dog running forward over green grass.": [], "The image on the left shows a single white dog being fed something.": [], "No image shows broccoli in a container, and the right image contains exactly two cut pieces of broccoli.": [], "knives are seen in the background in the right pic": [], "There is an adult human with a dog": ["adult human", "dog"], "The left and right image contains the same number of horses pulling a cart in different directions.": ["horses"], "One image contains multiple orange jellyfish, and the other image contains a single jellyfish with its 'cap' facing leftward and its tentacles trailing to the right.": ["multiple", "orange jellyfish"], "One of the images shows a ballerina dancing with a swan.": ["ballerina", "dancing", "swan"], "An image shows an apple-shaped terrarium to the right of a pear-shaped terrarium.": [], "One snow plow has two blades lowered to the ground.": ["snow plow"], "An animal is coming out of a television in one of the images.": [], "In one image the dog is wearing a collar and in the other it is not.": [], "In the image to the right, there is one dog standing in the grass.": [], "There is at least one human visible in one of the images.": [], "All of the boars have at least one person with a weapon posing behind them.": ["boars"], "At least one person is wearing a floral print shirt.": ["floral print shirt"], "An image contains a snow sculpture of a llama.": ["llama", "snow sculpture"], "There is a man in blue jeans standing behind a dog in one of the images.": [], "One man in a tan canoe is wearing a t-shirt and paddling with an oar.": ["tan canoe"], "both elephants tusks can be seen": ["elephants"], "In the image to the right, you will only see one dog.": [], "At least one of the doors has white trim.": [], "One image shows at least one smaller hound on top of an adult white hound lying on grass, and the other image shows a row of at least three hounds in similar poses.": ["adult white hound"], "One of the animals is standing on it's hind legs.": [], "At least five light-colored dogs are running forward over a field of grass in the left image.": [], "Each image shows just one ring binder, which is displayed open and is filled with paper and other supplies.": ["ring binder"], "One image shows mashed potatoes and gravy accompanied by a vegetable and another item on a round white plate.": ["gravy", "mashed potatoes"], "At least of of the desserts contains peaches.": ["desserts"], "There are objects on the inside of the door.": [], "There are two dogs that are staring straight ahead.": ["dogs"], "At least one image features an upright towel holder designed with an animal shape.": ["upright towel holder"], "The dog in the image on the right is sitting and wearing a black tie.": [], "One of the images shows two people in a cart being pulled by a donkey.": ["donkey"], "One image features a clear glass with a flat bottom holding water and one variety of flowers in it, and the other image includes at least one pink flower in something with a roundish shape.": ["pink flower"], "An image shows at least one ox pulling a cart built with rows of wooden slats in a rightward direction.": ["cart", "ox", "wooden slats"], "Santa Claus is featured on a towel.": ["Santa Claus"], "One image shows a neat row of three guinea pigs, all with different coloring.": ["guinea pigs"], "One image shows a standing dog with its body turned leftward, and the other image features a dog with its front paws flat on a surface in front of its body.": ["standing dog"], "At least 2 chairs are sitting on the patio outside the glass doors.": ["glass doors"], "In the image to the right, we've got three pups.": [], "At least one monkey is sitting in a tree in the image on the left.": [], "There are at least four pairs of black knee braces.": ["black knee braces"], "The cups in the left image are on saucers.": [], "One image contains one right-facing husky with curled tail standing on all fours, and the other image contains one young husky with white marks above its dark eye mask and upright ears.": ["curled tail", "dark eye mask", "upright ears"], "Two soap dispensers have a square shaped base.": ["soap dispensers"], "There are three people standing next to the car.": [], "There is a serving utensil in one of the images.": ["serving utensil"], "Balls of dough are spread out on a surface in one of the images.": [], "The left and right image contains at least two steamed broccoli pieces and one full head of broccoli.": ["steamed broccoli pieces"], "In at least one image there is a dark brown staircase end facing left with dark brown railing.": ["dark brown railing", "dark brown staircase end"], "The left image includes geese figures standing on a field of dry stalks, and the right image features rightward-facing black-necked geese in a scene with water.": ["geese figures"], "There are 2 pairs of animals made out of bananas.": ["animals", "bananas"], "There are vibrant colored photos present.": ["vibrant colored photos"], "The right image contains exactly two guinea pigs.": ["guinea pigs"], "The right image contains two dogs wearing life vests.": ["dogs", "life vests"], "There i a a single water bottle with an eblem on the front": ["water bottle"], "In at least one image there is a flag and flagpole in front of a monastery": ["flagpole", "monastery"], "Everyone on the left has their backs away from the camera, everyone on the right has their backs toward the camera.": [], "One dog is a gray hound with white chest patch, and at least one dog wears a collar with a charm dangling from it.": ["gray hound", "white chest patch"], "There are three dogs in the image pair.": ["dogs", "image pair"], "The right image contains three rodents.": ["rodents"], "Both dogs' front paws are visible.": [], "In one image, the back of a running shoe is balanced on a second shoe with the treads of its sole showing.": ["running shoe"], "In one image all dining chairs are the same, but two or more kinds of seating are in the second image.": ["dining chairs"], "There is a red octopus.": ["red octopus"], "An image shows multiple men standing under a straight row of suspended round lights, with windows flanking double doors along the back.": ["suspended round lights"], "In at least one image there is a total of three women in bikinis with at least one holding a drink.": ["bikinis", "women"], "The image on the left has exactly two Christmas themed hand towels, while the image on the right has at least one blue snowman towel.": ["Christmas themed hand towels", "blue snowman towel"], "The total number of warthogs is an odd number.": ["warthogs"], "There are at least 3 different colored dogs in the painting.": ["colored dogs"], "The image on the right has no more than three jellyfish.": ["jellyfish"], "A small fish is dropping towards the open bill of a pelican in the left image.": ["pelican"], "In at least one image there are four washcloths stacked on top of each other.": ["washcloths"], "The left and right image contains the same number of dogs with at least one laying down and one standing up.": ["dogs"], "A single shoe is sitting alone in the image on the right.": [], "There is exactly one snow plow in the right image.": ["snow plow"], "The left and right image contains the same number of saxophones laying on there side so that one can see down the opening of the hour.": [], "The right image contains exactly two dogs.": ["dogs"], "A German Shepherd is given a command and barking at something in one of the pictures.": ["German Shepherd"], "There are three cell phones in total.": ["cell phones"], "A dog is sitting on grass and is surrounded by yellow flowers in one of the images.": [], "there are two dogs in the image pair": ["dogs", "image pair"], "The windows have shutters.": [], "In the right image, water is pouring into a vessel sink accessorized with white flowers.": ["vessel sink"], "A tiny skunk with a thin white stripe down its forehead is sleeping on the side of its head.": ["skunk"], "There are over a dozen pictures of women with lipstick.": ["women"], "The left image contains no more than one bird.": [], "There are exactly three empty containers in the image on the left.": [], "The left and right image contains four knee pads on the floor.": [], "At least one of the beetles is pretty much entirely black.": ["beetles"], "In at least one of the photos, there is a heart.": ["heart"], "There are two antelopes in total": ["antelopes"], "there is one creature in the right side pic": [], "One image shows three dogs in the foreground, and the other contains one dog lying in the grass.": [], "Every safety pin in the images is closed.": ["safety pin"], "Several animals are attacking their prey in the image on the right.": [], "At least one graduate is holding a bouquet of flowers.": ["graduate"], "One image shows only acorns that are brown instead of green, only acorns that are uncracked, and only acorns without caps.": [], "Crabs are stacked on top of one another.": [], "Both trains are headed diagonally down towards the left.": [], "There are more dogs in the image on the right.": ["dogs"], "One of the images shows exactly two ferrets interacting with each other: one white/blond and one dark.": ["ferrets"], "The left image is of a single pelican facing slightly towards the left.": ["single pelican"], "Both images show standing dogs, one of them a white schnauzer, and the other a schnauzer with its body turned leftward.": ["chnauzer", "standing dogs"], "Each image features an open-mouthed doberman standing in profile, and the right image features a black-and-tan doberman with chain collar, erect ears and docked tail facing leftward.": ["chain collar", "d", "erect ears", "tail"], "At least one cord is extending from a round structure, and at least one yurt is on a treeless green field with something used in farming near it.": [], "In at least one image there are two closed window doors.": ["closed window doors"], "In at least one image there is a knot bread in front of a to go coffee.": ["knot bread"], "The left image contains one canine with their body facing towards the left.": ["canine"], "All of the the seals are laying close to the water on a brown, rocky beach in one of the images.": ["seals"], "In at least one image there is a slice of pizza being pulled from the left and the cheese is still attached to the rest of the pizza.": [], "Two or fewer goats are visible.": ["goats"], "At least one panda is lying on its back.": ["panda"], "The puppy on the right is reclining with outstretched front paws, and the dog on the left has a body part propped on something.": [], "Both classic cars are facing the same direction.": ["classic cars"], "There are no more than two ducks in the left image.": ["ducks"], "A crab's mouth is visible in each image.": [], "In one image, a three legged dog is wearing a striped sweater": ["striped sweater"], "One of the pizzas has pepperoni on it.": ["oni", "pizzas"], "The left and right image contains the same number of fully white canopies.": ["fully white canopies"], "The sink in the image on the right is not mounted onto a counter.": [], "At least one of the two stingrays in the pair of images is facing left.": ["stingrays"], "there are three ceramic vases with various shapes and sizes": ["ceramic vases"], "The balloon in the left image contains a teddy bear, the balloon in the right image contains smaller balloons.": ["teddy bear"], "In the image to the right, the wine bottle is NOT standing evenly on any type of surface that we can see.": ["wine bottle"], "there is a boat with an umbrella and flag on land": ["umbrella"], "One laptop computed is displaying a nature scene.": ["nature scene"], "There are exactly three shades.": [], "Each image shows two dog eyes, and each pair of eyes faces forward.": ["dog eyes"], "The left and right image contains the same number of goats.": ["goats"], "An image includes a person sitting in a chair and reading, and a person standing in front of bookshelves in the background.": ["bookshelves"], "One of the warthogs appears to be laying down, probably resting.": ["warthogs"], "A person has a hand around the neck of a camera-facing pug in the left image, and the right image contains exactly two dogs.": [], "There is a package of Great Value Paper towels with 6 rolls in it.": ["Great Value Paper towels"], "All the instruments are standing on their ends.": [], "The combined images include a square pillow overlapping a blanket draping the edge of a furniture item, and at least one pillow featuring a geometric Aztec-style pattern.": ["furniture item", "square pillow"], "We have more than two birds here.": [], "The combined images include at least one two-wheeled cart with a wagon bed on it, exactly one man, and exactly one horse.": ["wagon bed"], "A coyote is holding a dead animal in its mouth.": ["coyote"], "An image includes multiple orange-and-white balls, but does not contain more than three balls.": [], "To the left, we see three bottles of wine.": [], "Each image contains one spaniel, and the dog in the lefthand image has orange-brown spots above its eyes and dark ears.": ["lefthand image"], "There are exactly three rolls of paper towels.": ["paper towels"], "The right image contains exactly two red-feathered birds, and the left image contains at least one multi-colored bird in flight.": [], "A llama has leaves in its mouth.": ["llama"], "There are less than 6 bottles in at least one of the images.": [], "One or more dogs are visible.": ["dogs"], "Some of the beverages are in boxes.": ["beverages"], "Two images show two bedrooms of yurts, one of them furnished with a large bed, and the other with at least two sets of bunkbeds which are near an exit door.": ["bunkbeds", "yurts"], "The right image contains exactly two ferrets.": ["ferrets"], "An image shows hyenas around one crouching lion, which has its head turned leftward and its mouth open.": ["crou", "hyenas", "lion"], "There is a total of 10 chocolate covered banana pops.": ["chocolate covered banana pops"], "In at least one image there is at least eight acorns without their tops in a pile.": ["acorns"], "An image shows exactly three bikini models, and the models are not wearing hats.": ["bikini models"], "All images show pigs swimming across a natural body of water, all pigs swim in the same direction, and the left image contains more pigs than the right image.": [], "The left and right image contains the same number of red golf ball boxes.": ["red golf ball boxes"], "There are exactly two empty containers.": [], "The righthand image shows a large house with a roof notched out over the high windows, and the roof wraps around the side of the house like a hood.": ["righthand image"], "In at least one image there is a mother gorilla behind her baby.": ["mother gorilla"], "The women in the left image are all wearing matching bikinis.": ["bikinis", "matching", "women"], "A group of less than ten birds are picking at a carcass in the image on the left.": [], "The right image features one slope-front stainless steel sink mounted on the wall on the left.": ["stainless steel sink"], "There are two hanging canopies inside and most are circular at the top.": ["hanging canopies"], "The left image contains two hyenas.": ["hyenas"], "Each image includes three zebras posed in a row with their bodies parallel to one another.": ["zebras"], "The right image contains one dog standing on grass with its body facing towards the right.": ["dog"], "There are three empty beakers in the left image.": ["empty beakers"], "An image contains one camera-facing guinea pig with white down the middle of its face, posed in an outdoor setting.": ["guinea"], "There is 1 bird facing right in the right image.": [], "One of the gorillas shown is almost certainy a juvenile.": ["gorillas"], "A total of four 'real' dogs are shown, and one image shows three dogs posing on a 'loveseat' while wearing sweaters.": [], "No single image contains more than two ferrets, and the left image includes a white ferret, while the right image contains one peach-colored ferret.": [], "Each image shows a complete mitten pair and no other garment.": ["complete", "mitten pair"], "There is a delicious looking layered truffle of different varieties.": ["layered truffle"], "One image shows a real but very unusual, school bus while the other image shows a model or toy school bus.": ["toy school bus"], "At least one of the images has only one bottle.": [], "The left image contains no more than one gorilla.": ["gorilla"], "The lefthand image shows that the phone comes in at least three different colors.": ["lefthand image"], "The dog in each of the images is wearing a jacket.": [], "One man is facing right while playing the trumpet.": ["trumpet"], "The right image contains a circular pizza with one slice being removed.": ["circular pizza"], "We see images of fewer than four dogs.": ["dogs"], "The same black woman appears in each image, always wearing black and wearing different hairstyles.": ["hairstyles"], "There are paddles in both images.": ["padd"], "In at least one image there are multiple story homes carved in to the side of the mountain.": ["multiple story homes"], "There is a man wearing solid silver pajamas in one image, and a man wearing patterned pajamas in the other.": ["patterned pajamas", "solid silver pajamas"], "One image shows a stingray with its underside facing the camera and its head at the top, and the other image shows a stingray underside in a horizontal position.": ["stingray"], "One dog is lying down, and one dog is sitting up.": [], "One image contains no more than two short-haired guinea pigs posed on a blue surface, and the other image shows a single long-haired brown-and-white guinea pig.": [], "One of the cabinets has exactly three drawers with handles.": [], "One image features a single left-facing sneaker with yellow laces, and the other image shows a pair of sneakers.": ["yellow laces"], "The left image shows a yellow wheelless lift implement with a right angle shape, to the right of at least one upright barrel.": ["right angle shape", "upright barrel", "yellow wheelless lift implement"], "There is a red pot on the stovetop": [], "The right and left images contain the same number of spaniels, and all dogs have the same combination of fur colors.": ["fur colors"], "Neither image contains a male.": [], "There is no more than one dog in the left image.": [], "The saxophone in the right image is both silver and brass in color.": ["saxophone"], "The left and right image contains the same woman in a peach bikinis.": ["peach bikinis"], "there are 2 jellyfish upside down in the image pair": ["image pair", "jellyfish"], "There is a human touching a dog in front of them in one of the images.": [], "Each image contains a pair of hand coverings, and one image contains a pair of gloves with five full-length fingers that cover the finger tips.": ["hand coverings"], "The left and right image contains the same number of mugs.": [], "A woman is holding a syringe filled with a gold substance.": [], "The right image contains exactly one laptop.": [], "There are more than 3 geese.": ["geese"], "The right image shows a beagle that is airborne with a blue sky featured predominately in the background": ["beagle"], "The animals in the right and left images are engaged in similar recreational activities in similar settings.": ["recreational activities"], "All beetles have a curved, central horn.": ["beetles"], "In at least one image there a three blinds with at least one blue chair in front of them.": ["blinds"], "One of the images includes horses along with the dogs.": ["dogs", "horses"], "In at least one image that is a single black man with black shorts playing a silver drum with in a foot of other barrolls.": ["man", "silver drum", "single"], "An image shows at least five glowing bluish jellyfish against a dark blue background.": ["bluish jellyfish", "glowing"], "The left and right image contains the same number of boats with their sails open.": [], "The women in both of the images are touching their heads.": ["women"], "The right image shows an adult gorilla on all fours in front of multiple other gorillas.": ["adult gorilla"], "There are 7 wolves in the image pair": ["image pair", "wolves"], "There are two phones in one of the images and one phone in the other.": [], "One of the dogs is being held by a person.": [], "One image shows a guinea pig habitat with straw bedding and an arch made of wooden sticks.": ["arch", "guinea pig habitat", "straw bedding", "wooden sticks"], "There are people in exactly one of the images.": [], "In at least one image there is a star case with rails that have silver bent vertice rods.": ["silver bent vertice rods", "star case"], "A dog with long pointed snout and turned-down ears is wearing a blue collar with a tag hanging down in front.": ["long pointed snout"], "A solid-color yurt with contrasting roof and one visible door is sitting in a snowy landscape with trees in the background.": [], "A label is on the spine of the binder in each of the images.": ["binder"], "One bag has the union jack symbol on it.": ["union jack symbol"], "All the seals are on sand.": [], "Each image features at least one anemone with ombre tendrils that taper from green to violet-blue, and at least one image shows the round 'mouth' at the center of the anemone.": ["anemone", "ombre tendrils"], "One dog has a single ear flopping forward and the other ear erect, and the other dog has both ears in the same position.": [], "There is at least one uncut pizza.": ["uncut pizza"], "In one of the photos, there is at least one human sitting.": [], "In one image there is a single panda laying on its back.": ["panda"], "One image shows a stack of two pillows with pointed corners, and the other image shows flat-edged pillows, with one pillow leaning against a pillow that is lying flat.": [], "There is exactly one stuffed bear.": ["stuffed bear"], "The image on the left shows a row of three red chairs next to a ladder in the bookstore.": ["bookstore", "red chairs"], "Three seals are on a rocky surface.": ["seals"], "The right image shows at least one 'stand-alone' anemone with tendrils radiating around it but no stalk visible.": [], "There are two lemon trees.": ["lemon trees"], "The left and right image contains the same number of bottles with one that has at least two hearts on it.": [], "There are exactly four soap dispensers.": ["soap dispensers"], "At least one cheetah is near a pool of water, and two cheetahs have their heads lowered.": [], "There is one stand that is both glass top and wider than the TV it is holding.": [], "At least four dogs are eating food in at least one of the images.": ["dogs"], "The wild dogs in each of the images are standing in the water.": ["wild dogs"], "Each image contains one forward-gazing, close-mouthed hyena in the foreground.": [], "People are posed and visible, including torsos and some legs.": ["torsos"], "One photo shows a single dog laying down on a wooden floor.": ["wooden floor"], "Each image shows a group of musicians standing in front of cylindrical drums, and in at least one image, the musicians wear matching black shirts.": ["cylindrical drums", "musicians"], "Two similarly-colored and similarly-posed chow dogs are face to face in one image.": ["chow dogs"], "The left and right image contains a total of four groundhogs.": [], "One image shows a large seal touching noses with a baby seal.": ["baby seal"], "One image shows a man standing to the right of a standing woman, and each are holding saxophones but not blowing into them.": [], "Two dogs are sitting outside in the grass in the image on theleft.": ["dogs"], "there is a dog with a human hand touching their fur": ["dog"], "One image shows a dog missing a front leg, and the other shows a dog standing with use of a prosthetic for at least one back leg.": ["prosthetic"], "The wolf on the right is looking straight into the camera.": [], "A hyena has its mouth open.": ["hyena"], "A dog is resting on a thing floating on a pool.": [], "The right image shows a person holding a chihuahua up to their face, and one image shows a little girl with a chihuahua.": ["chihuahua", "little girl"], "The left image includes a row of barbells, and the right image features a man lying back on a bench with a barbell held up in each hand.": ["barbells"], "In one of the images, a single hyena is lying down on its side with its head up and looking straight at the camera.": ["single hyena"], "There is freshly cut dog hair on the table.": ["dog hair"], "The right image shows the outside of a barber shop.": ["barber shop"], "A single bird sits on a branch in each of the images.": [], "there are multiple ourdoor vending machines with greenery in the background": ["ourdoor vending machines"], "The left and right image contains the same number snow trucks.": ["snow trucks"], "At least one dog has its tongue sticking out.": [], "There is a single living bird in one of the images.": ["single living bird"], "There are puppies and babies face to face in the images.": ["babies", "puppies"], "Two smoothies have a fruit slice on the rim.": ["fruit slice", "smoothies"], "There are exactly three dogs in total.": ["dogs"], "A fish is swimming through the sea anemone in one of the images.": [], "There is exactly three cups of hot chocolate.": ["hot chocolate"], "One set of lips is not glossy.": [], "There are exactly two animals.": [], "In both images the bookstore's floor is visible.": [], "More more than two hyenas are eating a zebra in the grass.": ["z"], "Each image shows a single yurt with a wooden deck fence situated in a wooded area, with only one of them near visible water.": ["single yurt", "wooded area", "wooden deck fence"], "Each image shows exactly one wolf standing in water, and the right image shows a wolf with its mouth on a carcass with exposed ribcage.": ["exposed ribcage"], "There are two or more cups that are made of ceramic and filled with coffee.": ["coffee"], "there is mashed potatoes in a black plastic container": ["black plastic container", "mashed potatoes"], "None of the zebras in either image are drinking water.": ["zebras"], "Each image includes one hog standing on all fours in a field, and no image includes a human.": [], "There is a single arched window in the image on the right.": ["single arched window"], "there is a hot beverage machine with multiple circular slots": ["hot beverage machine", "multiple circular slots"], "In one of the images, there is at least one yellow book on a shelf below and to the right of the TV on the wall.": [], "The right image shows multiple people standing on the ground under a bunch of balloons with a gathered bunch of strings.": ["balloons"], "The right image contains a vertical stack of two pillows.": ["pillows"], "There is only one guinea pig in each of the images.": ["guinea pig"], "The dog in the left image is awake and the dog in the right image is asleep.": [], "One image shows exactly two balloons, one primarily blue and one primarily orange, which overlap in the sky.": ["balloons"], "In one image, a herd of llamas is in a green grassy area in front of trees with fall foliage.": ["fall foliage", "green grassy", "llamas"], "Two dogs are near green vegetation.": ["dogs"], "In one image, exactly five bottles of lotion with gold caps, but at least four different labels, are arranged side by side.": ["gold caps", "labels", "lotion"], "An image features a light blue cabinet with an arched top, feet, and a non-distressed finish.": ["light blue", "non-distressed finish"], "A dog is to the right of several wooly white sheep in one image.": ["wooly white sheep"], "Each image contains a single puppy, and the puppy in the lefthand image has its righthand ear erect and the other ear flopped forward.": ["lefthand image"], "In the image on the left, the dog is curled up asleep in the snow.": [], "One of the cabinets is yellow with legs, solid cabinet doors, and glass-front doors above them.": ["solid cabinet doors"], "The right image shows seals piled on multiple floating platforms, and the left image includes an upright seal in an uncrowded foreground.": ["multiple floating platforms"], "All rails and posts are straight and made of metal, each image includes wood-grain surfaces, and no surfaces are carpeted.": [], "There is at least one ladder leading to a bed in the left image": [], "Each image includes a beetle perched on a ball with its front legs touching the ground on the right side of the image.": [], "In at least one image there is a pizza with a slice cut out of it sitting directly on the table.": ["pizza"], "There is only one beaker in one of the images.": [], "At least one chew toy is laying near a chow dog in one image.": ["chew toy", "chow dog"], "One image shows exactly one white rodent lying down on the belly on a pale wooden floor.": ["white rodent"], "Both images contain a black and white dog.": [], "Each image prominently shows one chimp posed with a shoulder and bent elbow turned to the camera and its body facing rightward.": ["bent elbow", "chimp"], "The right image contains two black beetles.": ["black beetles"], "There are no more than 3 monkeys.": ["monkeys"], "An image shows a group of three pet rodents in a container, and all share the same fur coloration": ["fur coloration", "pet rodents"], "There are two small furry mammals facing opposite directions.": [], "There are plants sitting on something.": [], "The right image contains a human arm with several different shades of lipstick drawn on it.": ["human arm"], "At least one image shows an aerial view of a black beetle posed without a dungball.": ["black beetle"], "Each image shows exactly one girl, who is wearing matching knitted mittens and cap, her hands pointing up towards her face, and a large pompom on her hat.": ["cap", "hat", "knitted mittens", "matching"], "the birds beak if pointing right in the right pic": [], "An image shows two mugs of frothy brown beverage dispayed near rustic wood planks.": ["rustic wood planks"], "There are more than 4 monkeys in the forest.": ["monkeys"], "none of the fragrance bottles are rectangular.": ["fragrance bottles"], "In each image, a sink is set on top of a vanity surface, with a single faucet fixture centered behind it and extending over the sink opening.": ["faucet fixture", "vanity surface"], "A fork can be seen touching pasta.": ["fork"], "The pencil cases are not all the exact same color and style, and none of them are primarily black.": ["pencil cases"], "In at least one image there is a total of two antelopes in the grass.": ["antelopes"], "There is a warthog laying down.": [], "One image shows a staircase with white spindles and two wooden rails that curve outward at the landing.": ["staircase", "white spindles", "wooden rails"], "At least one sole of a hamster's foot is facing the camera.": [], "There are cheetahs eating in each image.": [], "The right image shows a woman with a gold-topped hypodermic needle in front of her.": [], "At least one dog's eyes are closed.": [], "In at least one image there are a total of twelve white golf balls.": ["white golf balls"], "Each image with at least three syringes shows them all displayed parallel to one another and at an angle.": [], "The images show two mammals.": ["mammals"], "An image includes an upright green bottle with an angled pump-type top and a silhouette of leaves on the side.": ["upright green bottle"], "An image shows a three-colored hound standing with its body in profile and its white-tipped tail raised.": [], "At least one of the water bottles is light blue with a silver cap.": ["water bottles"], "One image features one golf ball in the middle surrounded by at least five other balls in a circle-type formation.": ["golf ball"], "The left and right image contains a total of four white open sails.": ["white open sails"], "In at least one image there are two llamas.": ["llamas"], "All photos show a human actively slicing homemade dough into noodles.": [], "One dog in the image on the left is standing on the grass.": [], "One image shows a single sleeping pug with a closed mouth, and the other image includes three puppies sleeping close together.": ["closed mouth", "puppies", "single sleeping pug"], "there is a dog with it's mouth open showing it's tongue": ["dog"], "There are people in the right image.": [], "there are multiple jelly fish on a black background in the image to the left side": ["jelly fish"], "There are human legs visible in one of the photos of the pair.": ["human legs"], "At least one of the geese is swimming in the water.": [], "The dog in the image on the left is standing outside on all fours.": [], "A cabinet has a non-flat top with a center oval decoration, glass-front doors, and a flat base that sits flush to the floor.": ["center oval decoration"], "The left image contains one adult cheetah interacting with a baby cheetah.": ["adult cheetah", "baby cheetah"], "There are exactly two dogs in the left image.": ["dogs"], "There are four whole lemons and two half slices of lemons in the image pair.": ["image pair"], "Each image contains one sleeping \"\"\"\"blond\"\"\"\" dog, and each dog is posed with at least one paw forward and visible.": [], "The left image features at least one lipstick mark on pale skin, and the right image includes at least one pair of tinted lips.": ["lipstick mark", "tinted lips"], "There is one black binder open flat with white paper on the right side of it.": ["black binder"], "One of the monitors is silver in color.": ["monitors"], "The right image contains at least two rodents.": ["rodents"], "One of the photos shows multi colored safety pins attached to one single safety pin.": ["multi colored safety pins"], "Three dispensers are lined in a row in the image on the right.": ["dispensers"], "There are grapes near a wine glass in each image.": ["grapes", "wine glass"], "A roll of paper towel is in a stainless steel holder.": ["paper towel", "stainless steel holder"], "In one image, a female bodybuilder is standing in a gym near weight equipment while taking a selfie with her phone.": ["weight equipment"], "One white hamster is laying down and facing toward the right.": ["white hamster"], "A woman is with at least one dog in the image on the right.": [], "A boat with white sails in the up position is sailing in the water in the image on the left.": [], "One of the images shows two guinea pigs diving into a pool.": ["guinea pigs"], "The left image contains one standing hound with body turned rightward and eyes gazing leftward, and the right image includes someone in jeans standing behind at least one standing hound.": ["standing hound"], "One image features a pair of knee pads with round whitish shapes over the knees, worn on legs in long pants.": ["knee pads"], "The baby in the image on the left is wearing a hat with ears and sitting down.": [], "Two identical dining tables, each with chairs arranged for seating at least four, are placed side by side and are empty except for a centerpiece on each.": [], "One photo contains exactly six multicolored balls, the other image contains at least seven, and all images contain a yellow, blue, and orange ball.": ["multicolored balls"], "One image shows a single standing sea bird, and the other image contains exactly two pelicans floating on water and facing mostly forward.": ["pelicans", "single standing sea bird"], "One image features puppies next to an adult dog.": ["puppies"], "An image shows a single glass less than half-filled with red wine that is level in the glass.": [], "There are exactly four dogs.": ["dogs"], "One image shows a reptilian creature emerging from its green scene on a flat TV screen.": ["flat TV screen", "reptilian creature"], "One image contains two pairs of mittens, and no image shows handwear with individual fingers.": ["handwear", "mittens"], "A dog is standing in grass.": [], "In one of the images, at least one student is holding onto a banister.": [], "Some of the dinners have a cup near the plate.": [], "The left and right image contains the same number of brown and black dogs.": [], "There is a swimming pool in one image and a small hut in the other image.": ["swimming pool"], "There is only one pillow in the right image.": [], "The left and right image contains the same number of rodents.": ["rodents"], "The right image contains three safety pins that are three different colors.": ["safety pins"], "A pizza is displayed on a board surface containing red chile pepper, tomato, garlic, and other items.": ["pizza", "red chile pepper"], "The right image shows a man holding a giant cup of coffee.": [], "The combined images include two reddish-orange dingos standing with their bodies in profile turned in the same direction.": [], "Two dogs are together in an action scene, with the dog on the left in pursuit.": ["action scene"], "A marmot is standing on its hind legs.": ["marmot"], "Each image contains only one upright bottle, at least one image features a cap next to a bottle, and at least one image features a blue swirl bottle.": [], "Two ibex's are jumping from left to right.": ["ibex's"], "There are drain spiggots beneath the trays in the image on the left.": ["drain spiggots"], "None of the gloves pictured are black": ["gloves"], "The left image contains no more than two acorns.": ["acorns"], "The right image shows a lion interacting with at least one hyena in a scene with clouds of raised dust, and the left image shows only hyena.": ["hyena", "lion"], "There are more than two dingoes.": [], "An image shows a roll of paper towels on a vertical stand with a chrome part sticking out of the top.": ["paper towels", "vertical stand"], "An image shows a store display with upright bottles on open-fronted wooden shelves divided into rectangular compartments.": ["rectangular compartments", "store display", "upright bottles"], "The left image shows a wall-mounted white sink with one rectangular inset basin, a top-mounted faucet-and-spout, and a chrome bar beneath the sink.": ["chrome bar", "rectangular inset basin"], "There are at least 3 glass containers that contain fruit and whipped cream.": ["glass containers", "whipped cream"], "The right image contains at least two ferrets.": ["ferrets"], "There is at least one dining table sitting next to the cabinet.": ["dining table"], "There are two dogs, one of which is clearly older than the other": ["dogs"], "One of the cages contains an open enclosure.": ["open enclosure"], "There are exactly six cups in the left image.": [], "Exactly five beakers in one image are different sizes of the same design, and all are partially filled with blue liquid.": ["beakers"], "There is a bottle of pepper sauce with a gold-colored sealing band.": ["pepper sauce"], "The right image contains at least one dog.": [], "The containers in the image on the right have substances in them.": [], "There are horses attached to the carts.": ["horses"], "One image shows a camera-facing three-legged chihuahua wearing a striped sweater.": ["striped sweater"], "None of the towels are monogrammed.": [], "One of the dogs is not standing on a green bed of grass.": ["dogs"], "The animal in the left image has an open mouth, and the skunk of the right is standing on all fours with its body in profile.": ["skunk"], "The closet doors on the right are mirrored.": ["closet doors"], "There are at least 2 containers full of baguettes on a counter.": ["baguettes"], "At least one case is pinkish and depicts the Eiffel tower on its front.": ["Eiffel tower"], "An image shows one man crouched behind a downed long-horned animal, with a rifle in the scene.": ["rifle"], "Both crabs are standing on solid ground.": [], "Each image contains only white rectangular pillows, and one image features a single pillow laying flat, while the other image shows one pillow leaning against another.": [], "One image shows a pair of round-topped drums that sit upright without stands and taper from top to bottom, and the other image shows two more cylindrical, squat drums that have small feet.": [], "The left and right image contains the same number of faces in the barbershops.": ["barbershops"], "One puppy is not sleeping alone.": [], "The left and right image contains the same number of yellow orange snow trucks.": ["yellow orange snow trucks"], "There are 2 light brown bookshelves with at least 10 book on every shelf.": ["light brown bookshelves"], "The left and right image contains the same number empty clear glass soap dispenser.": ["clear glass soap dispenser", "empty"], "In one image, a row of three green plants sits on a rectangular table, which has light-brown armchairs at its ends.": ["rectangular"], "In at least one image there is a sailfish mounted on the wall.": ["sailfish"], "The right image shows a saxophone displayed with its bell facing the right and its mouthpiece at the upper left.": ["saxophone"], "Each image contains one tablet-type device, and one image shows the device with the screen inverted.": [], "There are more jellyfish in the image on the right.": ["jellyfish"], "In at least one image there is a two story building being held up by at least nine red wooden poles.": ["red", "wooden poles"], "Seven towels are arranged in stacks.": [], "There are only two dogs and both of them have their tails curled over their backs.": ["dogs"], "At least one dog has its mouth open.": [], "An image shows the exterior of a temple with red columns in the front holding up a roof with a turquoise blue ceiling.": ["temple", "turquoise blue ceiling"], "The weights in the right image are in use by a man, unlike the weights in the left image.": [], "Red and dark purplish-blue berries top at least one dessert in a footed glass.": ["dessert", "footed glass"], "At least 1 small puppy has its tongue out.": [], "In at least one image there is a locked pink case that is framed by metal titled with the left side forward.": ["locked pink case"], "The robed people in the image on the left are standing outside.": ["robed people"], "The napkins in at least one of the images have printing on them.": ["napkins"], "One image shows vertically stacked binders with the label edge showing, and the other image includes binders on a light-colored wooden shelf.": ["label", "vertically stacked binders"], "The combined images contain exactly two baby baboons, and each image includes at least one small animal with a bigger animal.": [], "The left image contains at least two ferrets.": ["ferrets"], "One image shows a woman's garment with safety pins forming a criss-cross bust and intricate geometric patterns.": ["intricate geometric patterns", "safety pins"], "One image shows a pointy-eared doberman with closed eyes viewed snout-first, and the other image includes a black-and-tan doberman snoozing on a blanket.": ["closed eyes"], "There is fruit on top of the dessert in only one of the images.": [], "The left image contains exactly two chimpanzees.": ["chimpanzees"], "There are two dispensers in the image on the left.": ["dispensers"], "All the cars are convertible and red.": [], "There is a total of 1 parrot with completely blue wings.": ["parrot"], "To the left, the birds are seen swimming.": ["birds"], "All chocolate coated treats have some type of stick inserted in the end.": ["chocolate coated treats"], "Each image shows no less than three people in graduation attire.": ["graduation attire"], "There are two birds sitting on hand rails.": ["hand rails"], "An image shows a hunter holding a rifle crouched behind a killed horned animal with its body facing leftward and its head turned to the right, nose on the ground.": ["horned animal"], "Exactly three elephants can be seen.": ["elephants"], "The left image contains no more than two cell phones.": ["cell phones"], "One of the dogs is all black, and the other one is not all white.": [], "There are no more than three geese in total.": ["geese"], "Two boats are in the water.": [], "IN at least one image there is a home with at least two windows and a white paintbase with blue line trim and only one chimen.": ["blue line trim", "chimen"], "One image shows one doberman in a bounding pose with all of its paws off the ground, and the other image shows at least one but no more than two dobermans sitting upright.": ["bounding pose"], "A tennis-type ball is on the grass in front of one spaniel, whose gaze is slightly upward and rightward.": ["one", "spaniel"], "there are clear jars in a row with a beetle inside": ["beetle"], "There is a beverage with a lid on it.": [], "In at least one image there a wood panel frame holding an open glass door that divides the room.": ["open glass", "wood panel frame"], "IN at least one imager there are four circle mirrors, two red and two black barber chairs.": ["barber chairs", "circle mirrors"], "Marmots are standing on their hind legs.": ["Marmots"], "one whole and one cut up lemon are on a wooden surface": ["lemon", "wooden surface"], "There is a blue chair with holes at a computer desk in one of the images.": ["blue chair"], "One of the images has three dogs either sitting or standing together in a row.": ["dogs"], "Three dogs are outside in the image on the right.": ["dogs"], "There are lemon slices on the dessert in at least one of the images.": ["lemon"], "The left image shows a face-to-face couple standing inside the basket of a hot air balloon with flowers in front of its basket.": ["flowers", "hot air balloon"], "The main sails are white in the left image.": ["main sails"], "The left and right image contains the same number of dogs with at least one facing forward right.": ["dogs"], "There are 3 beetles climbing on the balls.": ["beetles"], "there are books on shelves on a wood floor": [], "There is only one dog in one of the images.": [], "The image on the left has a single jellyfish with many tiny brown spots on its top section": ["jellyfish"], "At least one of the pillows has a minimum of 4 different colors in it's pattern.": ["pillows"], "The right image contains two horned animals, with bodies facing different directions and their heads close together.": ["horned animals"], "there are 7 pencil puches in the image pair": ["image pair", "pencil puches"], "In the image on the right, a child is holding a dog's leash.": [], "Both phones are flip phones.": ["flip phones"], "Windows are visible from inside a restaurant givinf a view of the outside.": [], "An image contains at least two dogs.": [], "Two models are standing.": [], "The left and right image contains the same number of cell phones being cleaned.": ["cell phones"], "Each image shows only a laptop open at a right angle, and the laptop on the left features a horizontal line and blue curving lines on its screen.": [], "There are exactly 2 bottles in one image, and exactly 3 in the other.": [], "There are exactly two dogs.": [], "A formal dining room features a square table with all matching upholstered chairs featuring contrasting trim, and two large light fixtures above the area.": ["chairs", "formal dining room", "holst", "light fixtures", "square table"], "Each image contains at least six golf balls of different solid colors with no print, arranged in some type of pattern.": ["golf balls", "solid colors"], "The drawing on the left features a single dog.": [], "The dough in the left image is being stirred by a mixer.": ["mixer"], "The buses in the left and right images are angled facing forward and toward each other, so they would eventually collide.": [], "There are two framed pieces of art on the wall behind a single white toilet.": [], "One of the organizers contains a pair of scissors.": ["scissors"], "One ibex is standing on the side of a mountain looking over the edge.": ["ibex"], "In at least one image, there is an adult standing in front of the bus door helping at least six kids getting into the bus.": ["kids"], "In the image on the right there are exactly 5 pillows.": [], "Each image contains just one container used for drinking, and the front of at least one of the containers depicts a city skyline.": ["city skyline"], "In at least one image there is a tower of three towels that start with largest to smallest.": [], "The left and right image contains the same number of phones.": [], "One of the images features multiple dogs lying on a couch.": ["dogs"], "One image shows a head-on view of a shop exterior, featuring lettering in white on black, and a display window with two panels to the right of the door.": ["display window", "shop exterior"], "The right image contains a pair of sneakers with indigo blue uppers and zig-zag stitching along the side, while the left image contains a single right-facing sneaker.": ["indigo blue uppers"], "There are exactly three actual, flesh and blood dogs.": ["dogs"], "Each sled driver is driving a group of at least five dogs.": ["sled driver"], "One of the girls is wearing a solid-colored hat, scarf and mittens.": ["mittens"], "At least one bottle is capped and one bottle is not capped.": [], "A dog is upright on a grassless dirt ground with square, non-diamond wire mesh alongside him.": ["dog", "grassless dirt ground", "non-diamond wire mesh"], "There are human hands showcasing the dough.": [], "Some of the bottles of lotion are laying on a pink cloth.": ["lotion"], "There are at least two hamsters inside the cages in each of the images.": ["hamsters"], "A waterbuffallo is standing on water in the righthand image.": ["waterbuffallo"], "The left and right image contains the same number of groundhogs on stone.": [], "The combined images include 6 blue vases, and at least one image contains only blue vases.": [], "the left side image has less then four items": [], "A dog is laying on its back": ["dog"], "Each image contains exactly one dog, and a dog is standing behind a food bowl.": ["food bowl"], "Each image contains a single yellow bus, and one of the images shows a toy-looking bus on a plain background, while the other image shows a bus with more than two wheels visible per side.": [], "There is a smartphone in the right image.": [], "Both restaurants are empty.": [], "One dog is being touched by a person.": [], "Here we have two locks.": ["locks"], "The left image contains a light blue wooden cabinet.": ["wooden cabinet"], "The left image contains one penguin in the foreground in an action-type pose, and the right image shows multiple penguins standing in front of snowy peaks.": ["snowy peaks"], "The combined images contain four hooved animals, at least three with horns.": ["hooved animals", "horns"], "The right image contains exactly two penguins facing each other.": ["penguins"], "There are no more than 4 drums in the image on the right.": ["drums"], "The left and right image contains the same number of homes.": [], "Two musicians are playing in the image on the right.": [], "The left image shows a stack of at least four round patties topped with a dollop of white cream and sprinkled with green ring shapes, all on a white dish.": [], "The left and right image contains the same number of black weights.": ["black weights"], "Both pictures on the right have a closed pad lock and the door is open just a crack.": ["closed pad lock"], "All four of the chimps are baring their teeth with a wide open mouth in an aggressive manner.": ["chimps"], "All of the cabinets have flat tops.": [], "Each image contains one half-lemon, green leaves and no more than two whole lemons.": ["green leaves"], "One image shows a baboon holding a fruit to its mouth, and one image shows a baboon with a wide-open mouth baring fangs.": ["baboon"], "The right image shows a person to the right of a white dog, with a hand on the dog's fur.": [], "One lemon is cut in half and has both halves facing outward.": ["lemon"], "At least one husky dog is sleeping in the snow.": ["husky dog"], "The left image contains two white ducks.": ["white ducks"], "There are two layered desserts.": ["layered desserts"], "A doggy door is open.": ["doggy door"], "The left image contains exactly one primate.": ["primate"], "One of the vases has a design painted on it.": [], "In one image the sails of a boat are furled, while three sails are unfurled on a boat in the second image.": [], "The right image contains a laptop with an all black screen.": [], "There is exactly one Erlenmeyer flask.": ["Erlenmeyer flask"], "An image contains a single chimp, which is eating something nut-like and holding more food in its hand.": ["chimp"], "One image shows a man behind and holding on to two hitched oxen who are running and creating splashes of water.": ["hitched oxen"], "There are at at least one bird standing on a branch in both images.": [], "At least one dog in the sled team on the left wears black booties, but no dogs in the sled team on the right wear black booties.": [], "In the right image, one horse is pulling a four-wheeled cart with two passengers to the right.": ["horse"], "At least one of the dogs has its mouth open.": [], "The left image contains one pump top bottle with a left-facing nozzle, and each product is displayed with its front label facing forward.": ["pump top bottle"], "One of the images contains at least three graduates with gold-colored sashes around their necks.": ["graduates"], "The left image contains at least two chimpanzees.": ["chimpanzees"], "There are three sheep one being brown and a pug in s sheep costume.": [], "A person's hand can be seen holding paper products.": [], "One dog is wearing a collar.": [], "Left image shows a forward-angled topless convertible with headlights that project upward and a hood that slopes downward, and right image shows a car with a top.": ["headlights", "hood"], "Several packages of canned beverage are on the very bottom shelf in the left image.": ["canned beverage"], "There are exactly three panda bears in the right image.": ["panda bears"], "In at least one image there is a green bookshelf with 7 shelves full of books.": ["green bookshelf"], "In one image there is a single decorative cabinet in a living area that is positioned on the left side of the room.": ["decorative cabinet", "living area"], "At least one image shows a hitched dog sled team with several reclining dogs.": ["hitched dog sled team", "reclining dogs"], "There is no more than one cheetah in the right image.": [], "the right side has bananas as dolphins": ["bananas", "dolphins"], "The left image shows one dog facing straight ahead, and the right image shows two dogs who gaze in the same direction.": [], "One image shows an older child standing in coordinating two-piece pajamas while the other image shows a baby sitting wearing one-piece button-up pajamas coordinated with a hat.": ["hat"], "The dog on the left is standing in the snow.": [], "At least one of the anemones has a bright red base.": ["anemones"], "There are exactly two pencil cases next to each other.": ["pencil cases"], "Both of the boats are at least partially in the water.": [], "There is a plant near the cabinet in the image on the left.": [], "An image features at least one dog in a crate, with its paws on the top edge.": [], "Each image contains one bluish vase with a flaring scallop-edged top and a shape that tapers at the bottom.": ["bluish vase"], "In at least one image there is a black ox with pointy horns facing straight up with his head facing directly forward.": ["black ox", "pointy horns"], "Two people in graduate attire are posing for a picture in the image on the left.": ["graduate attire"], "One of the images features a dog with its body pointing to the left of the frame with its head turned to face the right of the frame.": ["dog"], "The stairway railings are all dark colored.": ["stairway railings"], "In at least one image there is a slice of white cauliflower.": [], "There is at least one ray moving toward the left of the image with its underside showing.": [], "the right pic has the dogs mouth open": [], "The left image contains one horned animal standing with its body turned leftward and its head turned forward, and the right image contains at least three horned animals.": ["horned animal", "horned animals"], "In at least one image there is a single two tone colored crab facing forward being view from aerial position.": ["two tone colored crab"], "One image features exactly two side-by-side black-and-white dogs, and the other features one reclining tri-colored dog with both front paws extended forward.": [], "There are more animals in the image on the right than in the image on the left.": ["animals"], "The left image shows exactly three women, the right image shows four or more woman, and all women are wearing two piece swimsuits that are not the same color as each other.": ["two piece swimsuits", "women"], "There is a person working on a weight bench in one of the images.": ["weight bench"], "The right image contains exactly two colorful parrots.": ["colorful parrots"], "In one of the images, there are two pairs of shoes.": ["shoes"], "An image contains a sitting baboon who is holding a roundish, yellowish fruit.": ["sitting baboon"], "In one image two people can be seen working on a thatched roof.": ["thatched roof"], "there is at least one key next to the lock": [], "There are two water bottles, one primarily blue, and one primarily green.": ["water bottles"], "One image shows a canopy suspended from the ceiling that drapes the headboard end of the bed from a cone shape.": [], "An image includes mostly forward-facing graduates wearing pale blue sashes across their bodies.": ["graduates", "pale blue sashes"], "In at least one image there is a live red crab crawling across the sand": ["live red crab"], "There are multiple mirrors hanging on the left wall of the left image.": ["mirrors"], "In each image, a black ring binder notebook is standing on end with open edges to the back, and the binder end visible with a label attached.": ["black ring binder notebook"], "A single seal is sitting up on a rock in the image on the right.": [], "The right image shows a young man facing left at one end of a row of seated graduates in black, and the left image includes a graduate wearing purple and blue sashes and a black robe with purple sleeve stripes.": ["graduates", "purple sleeve stripes"], "there is a small square box with images of jellyfish inside": ["jelly"], "There are no more than three yurts in total.": [], "The left and right image contains the same number of antelope facing opposite directions.": ["antelope"], "Two long white shelves are hung on a wall over a desk, spaced to allow decor to be hung under one end of the upper shelf.": [], "One image shows exactly one horned animal with its body aimed rightward, and the other image shows exactly one horned animal with its body aimed leftward, but both images feature an animal gazing forward.": ["horned animal"], "There is a total of 1 completely black baby wolf with an adult wolf.": [], "An image contains at least two wolves.": ["wolves"], "At least one image shows camera-facing bearded men in black gown-like garments, posed mostly standing outdoors.": [], "The right image contains no more than one primate.": [], "There are 2 convertibles with the tops down.": ["convertibles"], "There are no more than five bottles of perfume.": ["perfume"], "There are multiple colored safety pins threaded onto one red safety pin.": ["colored safety pins"], "There are 3 phones on the left and two phones on the right.": [], "There is exactly two dogs in the right image.": [], "The left and right image contains the same number of soap dispenser that sit on the sink.": ["soap dispenser"], "Exactly one car is not a convertible.": [], "All images show one medium-blue convertible car in an open, outdoor setting.": [], "An image shows two similarly posed hamsters side-by-side on a green surface scattered with seeds.": ["hamsters"], "There is a light pole outside of the shop in one of the images.": ["light pole"], "The train in the left image is predominately red.": [], "the right pic has one dog": [], "One image shows multiple round shapes, and the other image features a puffy looking oblong item sprinkled with tiny black seeds.": ["multiple round shapes"], "One image shows one primarily yellow train headed leftward, and the other image shows on primarily red train headed rightward.": [], "At least one dog is next to a caged area.": ["caged area"], "The soda in the image on the left is not the original flavor.": ["soda"], "An image shows at least one person walking behind a flock of ducks and holding a stick out toward them.": ["ducks"], "a trifle has kiwi in the layers": [], "The left and right image contains the same number of birds.": ["birds"], "One of the images has two men with a dog between them.": [], "In one image, a suspended chandelier is centered over tables and chairs in a room with a yellow glow, and candle lights are glowing on some tables.": ["candle lights", "suspended chandelier"], "In at least one image there is a saxophone with keys that are a different color from the base instrument.": ["saxophone"], "In at least one image there is a single red balloon attach to a grave near at least three other gaves.": [], "A slice of pizza is being taken out of the pie in only one of the images.": ["pizza"], "All the marmots are on rocks.": [], "The right image features a dog with its front paws on a table top, and the left image features a dog lying down with another dog figure next to it.": [], "The right image shows a row of standing bikini models with at least one model's rear turned to the camera.": ["standing bikini models"], "A blue spotted sting ray sits on the ocean floor.": ["blue spotted sting ray"], "The left and right image contain the same number of alpacas.": ["alpacas"], "Each soda bottle has a blue lid and a blue label with a circle containing non-horizontal bands of red, white, and blue, along with lower-case lettering.": ["horizontal bands", "non", "soda bottle"], "Books are stacked high down an aisle in the image on the left.": [], "A single binder is standing on edge in one of the images.": ["single binder"], "Each image contains a single dog, and all dogs have similar black-and-white coloring.": [], "In one of the images, every beaker contains blue liquid.": [], "A man with a necktie tucked under his lab coat is holding up a syringe in at least one image.": ["lab coat", "necktie", "syringe"], "At least one sail boat is sitting in the sand next to the water.": ["sail boat"], "All dogs are standing on all fours, and all dogs are posed with their body in profile.": [], "In at least one image there are at least two people in the sled being pulled by less than five dogs.": ["dogs"], "There are more than two busses.": [], "The bookshelf in the image on the right is angled into a triangular shape.": ["bookshelf"], "There are three dogs.": ["dogs"], "At least one vending machine at a control panel with a very light gray background.": ["control panel", "vending machine"], "Each image contains only one animal and it is a dog.": [], "One of the images depicts a model train, while the other image is a real train with electrical lines overhead.": ["electrical lines", "model train", "real train"], "One image contains exactly three horned animals posed close together, and the other image includes multiple horned animals standing in tall 'grass'.": ["horned animals"], "There is an ibex in a wooded area with trees behind it": ["ibex", "wooded area"], "One orange fish with at least one white stripe is above white anemone tendrils with purplish tips in the left image.": ["orange fish", "purplish tips", "white anemone tendrils"], "the left and right image contains the same number of prairie dogs laying on rocks.": ["prairie dogs"], "An image contains a pug dog dressed in an outfit.": ["pug dog"], "Each image shows a parka with a fur-trimmed hood, and one parka is orange with black cuffs and trim.": ["a", "parka"], "An image shows a woman bundled in vintage wintry attire, standing and holding the leash of at least one standing hound.": ["standing hound", "vintage wintry attire"], "Atleast one picture contains a completed building.": ["completed building"], "One image includes a standing afghan hound with its black and white fur blowing in the wind, and the other image features at least one reclining hound with mostly blond fur.": ["reclining hound", "standing afghan hound"], "Some of the warthogs are swimming in water.": [], "Each image shows one forward-facing yellow-orange truck clearing snow with a plow, but one truck has a plow angled leftward, and the other truck has its plow more horizontal.": [], "One of the images shows an open laptop viewed head-on, with a screen displaying rainbow hues in a graph-like pattern.": ["open laptop", "rainbow hues"], "There are crabs inside an enclosed cage.": [], "The left image shows a horizontal row of four evenly spaced bottles, and the right image shows a row of at least two bottles.": [], "In each image, at least one pelican perches on some kind of platform in front of the same double-peaked building in the background.": ["pelican"], "Both sets have an image with a dog with dark fur.": [], "At least one dog is bearing its teeth.": [], "There is a single ferret  standing on a while surface inside.": ["ferret", "single"], "There are two birds with the front of their beaks facing the right side of the image.": [], "The bookstore in one of the images has been in business for 80 years.": ["bookstore"], "At least one dog is standing on the grass in front of a fence.": [], "One of the doctors is holding a syringe full of blue liquid.": [], "The right image shows a furry puppy lying on its belly on a wood floor, with its front paws extended and its head aimed toward the camera.": ["furry puppy"], "At least three towels of different solid colors are hanging, as if on hooks, over at least one stack of folded towels of different colors.": ["folded towels", "solid colors"], "The dog in only one of the images is actively hearding sheep.": [], "No image shows more than two whole lemons, and in at least one image a lemon has been cut in half.": [], "A cheetah is lying directly on some grass next to a human female.": ["cheetah", "human"], "The left image features a single fur-trimmed fingerless mitten with small embellishments dotting its front, and the right image shows a pair of fur-trimmed half-mitts with no thumb part showing.": [], "there are two dogs with chickens in the image pair": ["chickens", "dogs", "image pair"], "The left and right image contains the same number of snow trucks.": ["snow trucks"], "There are only two buzzards, one of which faces right in each pair.": ["buzzards"], "There are at least 1 or more blondes modeling pajamas.": ["blondes", "pajamas"], "All the dogs are near fences.": ["dogs"], "In one of the images, an eating utensil is holding a piece of broccoli.": ["eating utensil"], "There is an image of a dog standing still and facing forward.": [], "Each bottle of wine is sitting on a table.": [], "Both images contain stairs.": [], "There is a dog standing on four legs in each image.": [], "At least one cheetah is bending over water.": ["cheetah"], "One of the images shows a goat standing up perched on a rock.": ["goat"], "An image shows a forward-facing non-standing hound with a paw on some type of toy.": [], "In at least one image there are at least five firefighters who have put out the flame on a single home but are still fighting the smoke.": ["firefighters"], "A bottled plant is sitting in front of a window in each image.": ["bottled plant"], "there is one jellyfish in the right pic": ["jellyfish"], "The dog in the right image is pointed left.": [], "One image shows a bed with a dome-shaped canopy over it, and the other image shows a suspended canopy that draps around the bed.": ["suspended canopy"], "All the towels are white in the left image.": [], "In at least one image there is a single empty rectangle shelf.": [], "One image shows a gauze-like bed canopy over multiple people lying on the same mattress.": [], "An adult dog is wearing a collar, some dog is wearing a blue collar, and one dog is a puppy with floppy ears.": [], "One soap nozzle is curved, while the other is straight.": ["soap nozzle"], "Each image contains just one ferret, and one image shows a ferret in contact with a human.": [], "there is a wreath made of acorns hanging outdoors": ["acorns", "wreath"], "there are at least 2 large decorative bobby pins hanging on a wall next to a picture": ["bobby pins"], "The boar in one of the images has an extra furry coat on because it is wintertime.": ["boar"], "There are exactly three zebras.": ["zebras"], "The birds are only eating in one of the images.": ["birds"], "a woman in long sleeved pajamas is sitting on a chair": [], "In one of the images you can see something that is not a towel.": [], "The left and right image contains the same number of goat with at least one on the rocks.": [], "One image shows an adult red chow dog standing on all fours, and the other image shows a non-standing dog on the grass.": ["adult red chow dog", "non-standing dog"], "4 different colored pillows are stacked on top of each other": ["colored pillows"], "One image contains a group of at least seven brown llamas and white llamas, which face the same direction.": ["brown llamas", "white llamas"], "Two of the apes are showing their teeth.": ["apes"], "There are more than two wolves in the images.": ["wolves"], "Each image includes a bus with a non-flat front in the foreground, and multiple buses are visible in each image.": [], "One image shows various fragrance bottles displayed on a mirrored tray, and the other shows rows of fragrance bottles on at least one wooden shelf.": ["fragrance bottles", "mirrored tray", "wooden shelf"], "An image shows a fence in front of a white house with bold dark lines on it forming geometric patterns, and a roof with at least one notched cut-out for windows.": ["geometric patterns"], "The cheetah on the left is attending to it's young.": [], "Exactly one bird has a blue face.": [], "Each image contains a single dog, and all dogs are in resting poses.": ["resting poses"], "One image includes whole and cut lemons, but the other image does not contain any lemon halves or slices.": ["cut lemons"], "There is exactly one chimpanzee in the left image.": ["chimpanzee"], "At least one dog is near water.": [], "A glass stick is inside a flask and is positioned diagnonally.": ["glass stick"], "One of the beds has vertical posts.": ["vertical posts"], "the right pic has four or less people in it": [], "There are two glass becker.": ["glass becker"], "The combined images include four dogs, and all dogs are in playful poses.": ["dogs"], "The dogs in both images are near chickens.": ["chickens", "dogs"], "there are geese swimming in the water, there are dry weeds growing and the water has ripples from the wind": ["dry weeds", "geese swimming"], "There is only one perfume container in the image on the left.": ["perfume container"], "All images show dogs in snowy scenes, and one image includes a florward-facing dog with a face-full of snow.": [], "Some hamsters are sleeping.": [], "In at least one image there are at least three rows of children in red and orange.": ["children"], "Fingers are holding a tool-like object against the camera lens of a phone in the right image.": ["camera lens"], "There is at least one utensil laying on the plate in the image on the right.": ["utensil"], "No more than three flutes in total are shown, and all flutes are displayed diagonally aiming in the same general direction.": [], "There are two hands with gloves on them.": [], "In at least one image there are three white wooden window blinds.": ["white wooden window blinds"], "Exactly one dog is laying on the floor.": [], "A fuzzy gray baby penguin is near adult penguins in at least one image, and two standing penguins bend their necks and beaks downward toward each other in one image.": ["adult penguins", "fuzzy gray baby penguin", "standing penguins"], "There is a stop sign on a school bus that has a flat front.": ["school bus", "stop sign"], "One pizza is in a box.": [], "Loose rolls are sitting on a package of toilet paper.": ["toilet paper"], "One of the dogs is wearing a jacket.": [], "Both basins are sitting on a counter.": [], "Two boars are facing slightly to the left.": ["boars"], "The combined images include black and white stripes behind at least one dog, and arms holding at least four pug puppies.": ["pug puppies"], "At least 2 giant safety pins are hanging next to a sign that has the word Laundry on it.": ["Laundry", "safety pins"], "One of the images has rows or patches of brown penguins in the middle of the black and white crowd.": ["brown penguins"], "All dogs are black-and-tan dobermans with erect ears and open mouths, each image contains only one dog, and the right image features a reclining dog facing leftward.": [], "The left and right image contains a total of three elk.": ["elk"], "An identical number of ducks in a wet area can be seen in both images.": ["ducks", "wet area"], "Each image includes at least one young-looking baboon, and one image shows multiple grey-faced baboons with at least one very young baboon.": [], "One image contains at least twice as many chihuahuas as the other image, and the left image includes a dog with a wide open mouth.": ["chihuahuas"], "there is a set of 3 wooden flute parts laying in their carrying case": ["carrying case", "wooden flute parts"], "The right image contains a blue chair with holes in the backrest in front of a small wooden desk.": ["blue chair", "wooden desk"], "In the left image there are two golf balls on top of boxes.": ["golf balls"], "The left image contains exactly two white dogs.": [], "A hand is touching the back claws of a purplish crab that is rightside-up in one image.": ["purplish crab"], "All of the dogs in the images are outdoors.": ["dogs"], "There are exactly five bottles.": [], "There are people sitting.": [], "Two wooden frames of sleds are displayed, both with raised back for holding and runners than angle up in front, one of them outdoors in snow with rigging.": ["rigging", "sleds", "wooden frames"], "In one image, the sled driver is wearing blue with a white vest over it.": ["sled driver", "white vest"], "Two dogs are running.": ["dogs"], "One of the images features someone wearing a bracelet made of safety pins and beads.": ["safety pins"], "There is one animal in the grass in each photo, and the animal on the left has it's mouth open.": [], "a stringray is touching the sandy ocean pottom": ["sandy ocean pottom", "stringray"], "In both pictures, the dogs are outside in the snow.": ["dogs"], "One image shows three chimps squatting alongside each other, and the other image shows one very young chimp.": ["chim"], "In at least one image there is a brown rectangle tv with two silver knobs on it.": ["brown rectangle tv", "silver knobs"], "There are dinosaur shaped balloons inside a living area.": ["dinosaur shaped balloons", "living area"], "The birds in the image on the left are near a body of water.": ["birds"], "There are at least three dogs.": ["dogs"], "At least one of the soap dispensers is the type that mounts to a wall.": ["soap dispensers"], "One of the images shows a table with 3 potted plants on top of it.": ["potted plants"], "In one image a baby is wrapped in a terry robe with a hood and a matching belt that is tied in front.": ["terry robe"], "At least 2 regular mittens are stacked on top of each other.": ["regular mittens"], "The left and right image contains the same number of groundhogs.": [], "The left and right image contains the same number of lemons and lemon slices.": ["lemon slices"], "An arched doorway sits under the stairway in one of the images.": ["arched doorway"], "One image contains one man dressed in a beer bottle costume, and the other image shows a row of at least three people who wear similar beer costumes.": ["beer bottle costume"], "In at least one image there is at least two women dressed up in beer costumes.": ["beer costumes", "women"], "One image shows a single roll of paper towels that is still in its original packaging.": ["paper towels"], "Two look-alike afghan hounds with open mouths are reclining side-by-side and facing the camera directly.": ["mouths"], "One of the images shows right-facing zebras drinking water.": [], "One of the images has only one flight of stairs visible.": [], "The right image features a single pump-top bottle with its nozzle facing leftward and 3 black hearts on its front, and the left image includes at least one bottle with 3 black hearts on its front.": ["black hearts"], "A dark computer screen is housed in a lighter monitor case, with controls centered on a panel at the bottom between small speakers.": ["dark computer screen"], "A dining area with furniture under a light fixture is scene through an archway.": ["archway", "dining area"], "The left image contains one green bottle with a gold top.": [], "The left and right image contains a total of four single knee pads.": ["single knee pads"], "One image shows three side-by-side gray-and-white husky puppies in upright sitting poses, and all dogs in both images are puppies.": ["upright sitting poses"], "The horns of the water buffalo in one image are distinctively ribbed and curl inward to form closed circle shapes.": ["closed circle shapes", "water buffalo"], "One of the images shows a dog in a car.": [], "In at least one image there are two rows of baked goods in white to go boxes.": ["baked goods"], "The left image contains exactly two pandas.": ["pandas"], "There is a human within one of the images.": [], "At least 4 women are wearing bikinis and hugging each other in the image on the right.": ["bikinis", "women"], "The right image contains one chihuahua snarling and showing its teeth.": ["chihuahua snarling"], "Each image contains one unworn child's sleepwear outfit, and at least one outfit shown is a one-piece.": [], "One image shows a single stack of at least three folded towels of the same color but different sizes, and the other image shows multiple stacks of different solid-colored folded towels of the same size.": [], "Two rodents are in a container in one of the images.": ["rodents"], "Each image features a train with a curved V-shape on its front, and a blue lower half and pale upper half.": [], "There are two dogs looking to the (image viewer's) left.": ["dogs"], "The left and right image contains the same number of bottles.": [], "four bottles total": [], "At least 6 soda bottles are lined up in a row.": ["soda bottles"], "A total of three crab can be seen in the pair.": [], "Each image shows one beetle with a ridged wing segment posed on some type of textured surface.": ["ridged wing segment", "textured surface"], "There are three colorful birds, in bright red/green/blue colors.": [], "Each image shows one marmot with its head turned leftward, and at least one image shows a marmot with its black front paws on a rock.": ["marmot"], "There is at least 1 monkey actively swimming left.": [], "One of the crabs is resting on sand.": [], "There are two birds in the water in the image on the left.": [], "There is more than one animal species in the image.": ["animal species"], "Two faucet handles can be seen.": ["faucet handles"], "One dog is in snow.": [], "There is a single syringe in the right image.": ["single", "syringe"], "At least one of the images includes a large houseplant in a white pot on the floor.": ["houseplant"], "The left and right image contains the same number of dogs, with one short haired and one long haired.": ["dogs"], "A person is stretching the dough in the air in each of the images.": [], "There are exactly two bunches of attached balloons.": ["attached balloons"], "There are exactly two hyenas.": [], "All seals are shown out of the water, and at least one is draped over a rock and reclining on its belly.": [], "IN at least one image there is only a single violin and  saxophone set against darkness.": [], "The left image contains at least five bottles.": [], "In at least one image there is a house facing forward left with metal door windows.": ["metal door windows"], "A plain white closed binder is standing over one side of an open binder.": ["closed binder", "open binder"], "One of the images has a dog toy near the dog.": ["dog toy"], "The left and right image contains the same number of round bowls holding mash potatoes.": ["mash potatoes"], "the left picture has one hog in it": [], "All of the bottles in the right image are unlabeled.": [], "There is one sink and two toilets.": [], "There is fruit salad in a white bowl.": ["fruit salad"], "a dog is in the snow staring at the camera": [], "Each saxophone is displayed nearly vertically with its bell facing rightward, the saxophone on the left is on a stand, and at least one saxophone is black.": ["sax"], "In the image on the left, the napkins are placed in a container.": [], "Two marmots, one of them standing on hind legs, are in profile face-to-face in one image.": ["marmots"], "The left and right image contains the same number of dog with at least one puppy.": [], "One image shows a live ferret standing on all fours, and the other image shows a dead ferret lying on gray gravel.": ["dead ferret", "live ferret"], "There are zebras drinking water.": ["zebras"], "a dog is sitting in the grass with flowers": [], "One image contains no more than two cupcakes, which are covered in colorful sprinkles and sitting on a white table.": ["cupcakes"], "There is cut broccoli.": [], "In at least one image there are five white pillow backs on the opposite side of its built in bookshelves.": ["white pillow backs"], "The dog on the right is a doberman with docked tail and erect ears, standing with its body and head in profile, and the dog on the left stands in profile facing left.": ["doberman", "docked tail", "erect ears"], "One image contains a brown horse, one image contains a white horse.": ["brown horse", "white horse"], "An adult gorilla is opening its mouth wide, revealing fangs and a mouthful of teeth in one image.": ["adult gorilla"], "Each image contains one dog standing still on grass, and at least one dog is in profile facing leftward.": [], "The bird in the image on the left is flying in midair.": [], "The left image shows a line of zebras facing the same direction and drinking while standing in water, while the right image shows zebras standing in the grass.": ["zebras"], "There are six or more vending machines that have food or drinks.": ["vending machines"], "Each image contains a single model, and none of the apparel modeled has a non-neutral color.": [], "There are four or five zebras running on the land.": ["zebras"], "In the image to the left, there is only one black kneepad.": ["black kneepad"], "A beetle on top of a dungball is facing left.": ["dungball"], "Each image contains at least one inflated balloon, but the lefthand image contains a greater number of inflated balloons.": ["inflated balloons", "lefthand image"], "There are at least 3 pairs of shoes with mismatched colors.": ["mismatched colors", "shoes"], "In at least one image there is a total of three white towels folded and stacked.": ["white towels"], "Each image includes a red convertible, and each convertible has its top uncovered.": ["red convertible"], "One dog is black.": [], "In at least one image there are two pieces of silverware.": ["silverware"], "A dog is standing on all four feet facing to the left with its tail sticking out straight.": ["dog"], "No hands are holding a puppy, and one \"\"\"\"ginger\"\"\"\" puppy is posed on the seat of a vehicle.": [], "At least one of the dogs are moving.": [], "One image shows a male figure wearing a suit jacket and fedora hat who is holding a saxophone.": ["fedora hat", "male figure", "saxophone", "suit jacket"], "There are two ibex in the left image.": ["ibex"], "The left and right image contains a total of three snow trucks.": ["snow trucks"], "In one image, the dessert is near a red and white cloth.": ["dessert"], "There are exactly two cups in total.": [], "One image contains no more than two shoe depictions, but not a side-by-side pair, and the other image shows rows of left-facing shoes on floating platforms in front of a brown wall.": ["brown wall", "floating platforms"], "There are two sneakers in each photo and each has a black Nike swoosh logo on the side.": ["black Nike swoosh logo", "sneakers"], "There are more shoes in the image on the left.": [], "An image shows one left-facing sled on snowy ground, with no humans nearby.": [], "The bottle on the right is larger than the bottle on the left.": [], "There is a pizza on a wodden table with varying vegetables near it, some ov the vegetables are peppers and tomatoes": ["pizza", "wodden table"], "One image shows a wolf with its face turned forward, head upright, body turned leftward, and at least one front paw off the ground.": ["wolf"], "Some of the lemons in both images are cut.": ["lemons"], "One boat has unfurled white sails, and the other has furled white sails.": ["furled white sails", "unfurled white sails"], "All dogs are wearing raincoats.": [], "In at least one image there is a single black bull up to its shoulders in water.": [], "In each image, one man in all white is standing and holding up one end of a length of dough in each hand.": [], "Both anemones are green with blue highlights.": [], "There is a dog on a pool raft in the left image.": ["pool raft"], "One or more drum set is not pure black.": ["drum set"], "A paved road passes near the house in the image on the right.": ["paved road"], "An image shows a unit with side-by-side dual dispensers, which feature Asian characters and bold black letters on the front, as well as black press buttons.": ["Asian characters", "black press buttons"], "The combined images include acorns embellished with paint and with patterns, and acorn shapes displayed in a bowl.": ["acorn", "acorns"], "In one image the llamas are only white and in the other they are both white and brown.": ["llamas"], "Only one image contains a large red Pocky sign.": ["Pocky sign", "red"], "There is one dog in both images.": [], "In one image, there's a jellyfish moving to the right.": ["jellyfish"], "A smiley face is in the milk foam of a latte.": ["latte", "milk foam"], "All dogs are standing on all fours with their bodies turned in the same direction.": [], "The right image depicts two side-by-side beige pugs wearing yellowish-green flotation vests and posed with their top halves out of the water.": ["beige pugs", "ests", "fl"], "One ferret is laying on pavement.": ["ferret"], "There aren't any people sitting at the tables in any of the images.": [], "There is a total of two phones.": [], "In exactly one image there are sliced kiwis in a dessert bowl.": ["dessert bowl", "sliced kiwis"], "An image shows just an adult gorilla glaring forward and on all fours.": ["adult gorilla"], "Exactly four dog eyes are visible close up.": ["dog eyes"], "One bright-colored sliding door with a rectangular window in it is fully open, revealing a nearly empty white space beyond the doorway.": ["rectangular window", "sliding door"], "The fragrance bottle on the left is green with a silver cylindrical cap, and the bottle on the right is an upright rectangle with rounded edges.": ["fragrance bottle", "silver cylindrical cap"], "One figure is holding something and the other isn't.": [], "In one image, trucks with snowblades are moving in a coordinated row to remove snow from highway lanes.": ["highway lanes", "snowblades"], "Birds are gathered around their prey in the image on the right.": [], "The left and right image contains the same number of golfballs": ["golfballs"], "Only adult hamsters can be seen in these images.": ["adult hamsters"], "The combined images include parking lots where buses are parked facing forward and facing backward.": ["parking lots"], "The combined images include at least one black-and-white dog and at least one sheep figure.": ["sheep figure"], "An image shows a baby chimp and baby gorilla sitting side by side and interacting.": ["baby chimp", "gorilla"], "The left image shows a staircase instead of a ladder leading up to a loft.": ["staircase"], "There is greenery in front of one of the houses.": [], "Two packs of dogs are pulling sleds in one of the images.": ["dogs"], "One panda's teeth are visible.": [], "There are two white drawers in the image on the left.": ["white drawers"], "An image shows a trio of side-by-side rectangular dispensers, each filled with a colored substance, but none containing a lavender substance.": [], "There are two jellyfish and they both appear to have long tails trailing below them.": ["jellyfish"], "Some bananas are on the ground.": [], "there is a human in the left side pic": [], "The dog in the image on the right is sitting up.": [], "Several boats are in the water in the image on the left.": [], "The right image contains a single individually- wrapped upright paper towel roll, and packaging in the left and right images features different color schemes.": ["color schemes", "packaging", "paper towel"], "Water buffalo are walking in a line down a dirt path in one image, and the other image contains one massive brown buffalo standing in profile.": ["Water buffalo"], "There is at least one multi product set in the images.": ["multi product set"], "A seal is sunbathing on a deck near the water.": [], "Items are displayed on top of at least one of the storage units, and a stuffed animal is sitting on a shelf in the storage unit on the right.": ["stuffed animal"], "A yellow helicopter is sitting in the snow.": ["yellow helicopter"], "Each image includes a bus with a nearly flat front that is facing leftward, and at least one of the buses has a door on the side facing the camera.": [], "The left image includes a TV and a black rectangular, horizontal media storage unit, and the right image shows a TV mounted on a flat whitish surface that is not an actual wall.": ["horizontal media storage unit"], "A part of the sky is visible in one of the images.": [], "a dog is sleeping in its back with legs and belly visible": ["dog"], "In one of the images a puppy is standing on a wooden surface.": ["puppy", "wooden surface"], "Both images in the pair show paper towels from the same brand.": ["paper towels"], "Each image contains only one llama, and the llama on the right looks toward the camera and has upright ears that curve inward at the tips.": ["ears", "llama"], "In at least one image there is a single brown dog going through a doggie door.": ["doggie door", "single brown dog"], "One image shows antique safety pins displayed on a perforated flat object with a point at its base.": ["antique safety pins", "perforated flat object"], "The left image includes at least one black fish with white dots swimming above pale anemone tendrils, and the right image features at least one orange-and-white clownfish above pale anemone tendrils.": ["black fish", "pale anemone tendrils", "white dots"], "In at least on image there is a single hyena with black paws facing right with its face slightly forward.": ["hyena", "single"], "All dogs shown are white, and the dog in the left image has its mouth open with fangs bared.": [], "The boat on the left has an American flag on one end, and all boats depicted are in the water.": ["American flag"], "At least one convertible is facing right.": ["convertible"], "There are at least 4 gorillas sitting in the greenery.": ["gorillas"], "One image features a multi-door scene with one tree and floating pink petal shapes, and the other image features a multi-door scene with a tree on each side.": ["floating pink petal shapes"], "A human hand can be seen holding a cup.": ["human"], "A light brown dog is wearing a harness.": ["harness", "light brown dog"], "One of the images features someone holding a syringe.": ["syringe"], "One image shows a yellow-cabbed truck with its plow at an angle that makes it look sharply curved and concave.": [], "The bird in one of the images is standing on the ground.": [], "The dumbbells in the image on the right are shown in a variety of colors.": ["dumbbells"], "One image shows a baby cheetah alone on green grass, and the other image shows a baby cheetah standing with its front paws on a reclining adult cheetah.": ["baby cheetah"], "there is a husky laying on a sofa with at least one pillow holding a stuffed animal": ["husky", "stuffed animal"], "One image features white golf balls with nothing printed on them, and the other image features white golf balls with printing on them in a container.": ["white golf balls"], "At least one sail boat is parked on the left side of the dock.": ["sail boat"], "One train is heading right and one train is heading left.": [], "An image shows part of a starfish alongside a jellyfish, and both are peachy-colored.": ["jellyfish", "starfish"], "One image in the pair shows a single pig swimming and the other shows at least two pigs swimming.": [], "There are no more than two seals.": ["seals"], "There are two warthogs in the pair of images.": [], "One image shows balloons on strings that gather to a point against a blue sky, but no one holding the balloons.": [], "There are no more than six dogs or puppies featured in the pair.": ["dogs", "puppies"], "One dog has its tongue out.": [], "A dog is bending toward a cupcake on a table in the left image, and has at least one paw on the table.": ["cupcake"], "The dog on the right is laying down.": [], "An image shows a round building that has solid wood walls and has a square edged deck around at least part of it.": ["solid wood walls", "square edged deck"], "Two skunks stand on a piece of wood in one of the images.": ["skunks"], "There are only two adult skunks.": ["adult skunks"], "In one of the images, there is a television attached to the bookshelf.": [], "There are a total of two school buses.": ["school buses"], "The right image features a pale couch with colored throw pillows next to a row of narrow rectangular windows with ungathered off-white shades.": ["colored throw pillows", "pale couch"], "The left and right image contains the total of two antelopes.": ["antelopes"], "There are more monitors in the image on the right than on the left.": [], "One image features a squarish light-colored building with a tiered green roof and columns in front of an arch doorway.": ["arch doorway", "tiered green roof"], "One dog is wearing a red collar.": [], "In at least one image there is a single round kitchen table with four legs.": ["kitchen table", "single"], "The left and right image contains a circle and square canopy.": [], "An image shows one barefoot boy riding a head-lowered water buffalo and holding a stick.": ["barefoot boy"], "The right image includes at least one round shape containing broccoli wrapped in clear clingy plastic.": ["broccoli", "clear clingy plastic"], "There are a total of 1 pelican that has black markings.": ["pelican"], "there are sled dogs moving toward the camera": ["sled dogs"], "The combined images include two apes with open mouths showing teeth.": ["apes", "mouths"], "One dessert made with sliced bananas is garnished with mint leaves, while a second dessert is garnished with coconut flakes.": ["coconut flakes", "mint leaves", "sliced bananas"], "One image shows a stingray on the seabed, and the other image features a black stingray with vivid white markings and two sucker fish attached on each side of its head.": ["black stingray", "sucker fish"], "In the image to the right, several televisions are powered on.": [], "All of the pelicans are on shore and none of them are extending their wings.": ["pelicans"], "Each image contains one bird, and the bird in each image has primarily green feathers.": [], "At least one image shows a bookstore interior with glowing yellow tent-shaped lights suspended from an astronomy-inspired blue ceiling.": ["bookstore interior"], "Each person in the image is wearing a gradation robe as well as a graduation hat.": ["gradation robe", "graduation hat"], "In at least one image there is a two wall silver and glass work office.": [], "There are more desserts in the image on the left.": ["desserts"], "Exactly one drum has drum sticks laying on top.": [], "There are two different shoes pointed in the same direction": [], "There are three white dogs in one image and one white dog in the other image.": ["white dogs"], "No guinea pig is one solid color, and the right image contains twice as many guinea pigs as the left image.": [], "One image shows a closed pink case with metal corners, and it is displayed upright at an angle.": ["closed pink case"], "Left and right images each contain one round pizza, the pizza on the left has a slice that is at least partly removed, and the pizza on the right is on a round platter.": ["pizza"], "The left image contains exactly two dispensers.": [], "There is exactly one cat that is entirely black.": [], "There is at least one blue dress.": [], "All of the dogs are standing.": [], "The left image contains exactly two dogs.": ["dogs"], "Both images contain two whole fruits and one half fruit.": [], "A man is sitting.": [], "A small pug dog is laying with a baby.": ["pug dog"], "There are two syringes, and both of the needles have liquid dripping from them.": ["needles", "syringes"], "There are more vehicles in the image on the left.": ["vehicles"], "The right image shows a hound standing with its body in profile, and the left image shows a hound that is not gazing rightward.": ["hound"], "In at least one image there is a full coke bottle with a single hand pressing a white circle pump.": ["coke bottle", "white circle pump"], "There is a total of eight drink bottles.": ["drink bottles"], "One image contains a single puppy, and the other image contains a horizontal row of four spaniels with similar poses but varied fur colors.": ["spaniels"], "A man is riding between two animals.": [], "Each image features one hinged wooden flute, and at least one image shows a hinged flute tied with straps of leather on a plain white background.": ["hinged wooden flute"], "All of the horses are light brown": ["horses"], "We can see at least one circular mirror.": ["circular mirror"], "A model engine is shown alone on the track in the image on the left.": ["model engine"], "There are three golf balls outside of the boxes.": ["golf balls"], "The monkey in the image on the right has its mouth closed.": [], "In one image, a little dog is being cradled by a person, one hand clearly visible, and held up beside the person's face.": [], "Each image contains an old-fashioned TV with controls on the right of its screen, and no TV has a lit screen or picture displayed on the screen.": [], "A collage of 5 different shades of lipstick are depicted on a woman's lips.": [], "An image shows a rearward-facing convertible with its top partly extending up.": [], "There are people visible.": [], "The dog on the left has a smiling face, and the dog on the right is baring its teeth.": [], "Each dog's pretty, curled tail is prominently displayed.": [], "At least one of the images shows a group of bottles standing together.": ["bottles"], "The dog in the image on the left is wearing a black collar.": [], "Each image shows one vase with an open top, a short base, a tear-drop shape, and no handles.": ["vase"], "At least one stingray is facing left.": ["stingray"], "In at least one image there is a fish etched in to the wall of an empty diner.": ["empty diner"], "Nine or more pills are visible.": [], "The left image contains a white dog eating food.": [], "The dog on the left has his left ear raised up.": [], "There are two deer on the grass.": ["deer"], "A dog sitting on a seat and facing forward has an upright cup between his front paws.": [], "One image contains a standing orange-and-white collie, and the other shows three collies sitting upright.": [], "We do not have three smoothies here.": [], "Each image contains only one marmot and no marmots are standing on their hind feet.": [], "An image shows a smiling young person extending an arm holding a dark glass beer bottle.": ["dark glass beer bottle"], "The left image shows two clear glass mugs that have snowmen and christmas trees printed on them and are filled with a brown drink with white foam on top": ["christmas trees", "clear glass mugs", "snowmen"], "Exacty two bottles with caps, but of different designs, are shown, one bottle in each image.": [], "One of the images features exactly three musicians.": [], "There are at least 9 puppies.": ["puppies"], "There is a dog sleeping with a santa hat on": ["dog", "santa hat"], "At least one dog is looking at some treats in at least one picture.": [], "Each image shows face-forward crabs with deep-purplish shells and jagged-edged front claws.": [], "There are both gray and white section of  fur on a single wolf whose body is facing right with their head tilted left forward.": ["wolf"], "Three Corgis are wearing clothes and laying on a sofa.": ["Corgis"], "In both images someone is wearing a flower.": [], "The combined images contain three spotted wild cats, and one cat is a juvenile.": ["spotted wild cats"], "The girl in the left image is blonde.": [], "At least one of the images features fried chicken from a restaurant.": ["fried chicken"], "There is one kneepad worn by a human in each image.": ["kneepad"], "No afghan hound is in an action pose, and one hound's hair is blowing backward by the wind.": ["afghan hound"], "The left image is absolutely full of balloons, the right image has balloons and sky.": [], "There are three Collies in the right image.": [], "The left and right image contains the same number of dogs.": ["dogs"], "Wolves are attacking a deer.": [], "All of the dogs are standing up.": [], "In at least one image there is at least one bunch of broccoli sealed in plastic wrap.": ["broccoli", "plastic wrap"], "One of the crashed buses has at least two tires up in the air.": [], "There is a blue tent.": [], "There is a single bus in the right image.": [], "The device on the left has number keys, the one on the right does not.": ["number keys"], "There is a single dog wearing a coller in one image.": ["coller"], "The dog in the image on the right has all black fur.": [], "An image shows a hand holding a phone near the keyboard of an opened laptop.": ["opened laptop"], "Both ducks are in water with one facing right and one facing left.": [], "One of the images contains at least one shelving unit that is mounted on the wall.": ["shelving unit"], "One llama is resting on the ground with its head raised near a llama standing on all fours in one image.": ["llama"], "there are bobby pins pinned together to greate a necklace": ["bobby pins", "necklace"], "One image shows one bird, which has a red head, and the other image shows a matching pair of birds with blue coloring on top of their heads.": [], "There are tables with single seat chairs in each image": ["single seat chairs"], "A pug and a rightward-turned standing sheep have their faces close together in the left image.": [], "All the jellyfish have long tentacles.": ["jellyfish"], "There are exactly four birds perched on a branch in the pair of images.": [], "There is a machine in the image on the right near a trash can.": ["trash can"], "Each image contains a dog with black spots on white fur, and the large spotted dog is in a reclining pose near a french bulldog in one image.": ["french bulldog", "reclining pose"], "Each image shows one frontward-facing wolf, but one wolf has its head and gaze turned slightly to the left.": [], "There is no more than one dog in each image.": [], "You can see the tongue hanging out of the mouth of the dog on the left.": [], "Each image contains a single pelican in the foreground, and the birds in the left and right images face the same direction.": ["birds", "pelican", "single"], "There is a single gorilla in the left image.": [], "A marmot facing right is in a horizontal position on a field dotted with purple wildflowers.": ["marmot", "purple wildflowers"], "There is a stairway with an arched doorway under the stairs": ["arched doorway", "stairway"], "there is a single dung beetle pushing a dungball": ["dung beetle", "dungball"], "All paper rolls are upright, and one image shows a paper towel roll on an upright stand.": ["paper towel roll"], "Each image shows a single shoe with three diagonal stripes on the shoe's side, and the shoes in the left and right images face the same direction.": ["diagonal stripes", "single shoe"], "There are 1 or more completely black beetles.": ["beetles"], "There are more than three people in the right image.": [], "At least one image is of a multi-serving trifle bowl.": [], "The picture on the left shows a malinois sitting down attached to a blue leash.": ["malinois"], "All the snow plows are plowing snow.": ["snow plows"], "One image contains exactly one adult wild pig standing near at least four baby piglets with distinctive striped hides.": ["adult", "baby piglets", "striped hides", "wild pig"], "There are three monkeys all together.": [], "One of the dogs has a red jacket": [], "There is at least three dogs.": [], "In one of the images, there are three jellyfish.": ["jellyfish"], "One image shows multiple parked yellow plow trucks, with no snow in sight.": ["parked", "yellow plow trucks"], "In one photo, there is a puppy.": [], "There is a dog sleeping with a colorful prop.": [], "At least one television hangs on a wall near some simple paintings.": [], "The left and right image contains the same number of brown bookshelves.": ["brown bookshelves"], "There are two closed locks.": ["closed locks"], "The guinea pig on the right has beige fur and is posed on folds of pink fabric.": ["beige fur", "guinea pig"], "The right image is an interior with a bench that runs along the right side behind tables and chairs, and suspended lights hanging above that run the length of the room.": ["suspended lights"], "Both pajama outfits some shade of blue and are modeled by caucasian adult men in non-standing poses.": ["caucasian adult men", "non-standing poses", "pajama outfits"], "The left image features a four-wheeled wagon pulled rightward by two horses, and the right image features a two-wheeled wagon pulled leftward by one horse.": [], "Two birds are in water.": [], "The dog on the left is presently laying down; full body on the ground.": [], "No shoes contain a color besides black, white and gray, and at least one image features a pair of sneakers with the sole of one shoe facing the camera.": [], "The image on the right contains at least 1 balloon that hasn't been inflated.": [], "The right image contains exactly two parrots.": ["parrots"], "The left and right image contains the same number of  sailboats.": ["sailboats"], "Each image has at least one compact in it.": [], "One image contains one dog standing on all fours and gazing upward, and the other image contains two pale dogs in similar, side-by-side poses.": ["pale dogs"], "There are two unopened pencil cases in the pair of images.": ["unopened pencil cases"], "One image contains no more than two graduates in the foreground and features a black robe, black cap, and multicolored striped sash for attire.": ["black cap", "black robe", "graduates", "multicolored striped sash"], "The pizza on the right is totally round, unsliced and on a wood-grain rounded-edge surface, and the pizza on the left is round and sliced into at least four 'pie wedge' pieces.": [], "In the left image, there are just two acorns.": ["acorns"], "No open laptop is displayed head-on, and laptop screens in the left and right images do not face the same general direction [left or right].": [], "A slice is separated.": [], "There are only laptop computers.": ["laptop computers"], "One image shows a bouquet with gathered green stems but no vase, and the other image features a bouquet in a clear vase so the stems show through it.": ["bouquet", "clear", "gathered green stems", "vase"], "The dog in the image on the right is standing up on two legs with a human.": [], "there is at least one tube of lipstick with a silver base and gold accents": [], "An image shows a hamster clutching a snack while posed with its hind legs raised off the ground and at least one pink sole showing.": ["hamster"], "there is a tv with the cord draped over the top and dangling in front of the screen": [], "One image shows an open binder in front of a row of upright binders with white rectangles and black circles on the spines.": ["open binder", "upright binders", "white rectangles"], "The left and right image contains the same number of tented canopies beds.": ["tented canopies beds"], "A single dog is lying down in the image on the left.": [], "In at least one image there is a bright solid colored door with at least one window in it.": [], "A silverback male gorilla is face to face with a smaller gorilla in the right image.": ["silverback male gorilla"], "In one image, a dog has its mouth open.": ["dog"], "Two black laptop computers are open with the screen tilted slightly back, one with a keyboard the full width of the laptop, and the second with a shortened keyboard and square mouse area.": ["black laptop computers", "square mouse area"], "In one image, a brunette is seen wearing a surgical face mask.": ["brunette", "surgical face mask"], "The right image contains no more than two ducks floating in water.": [], "There is a utensil in the food.": ["utensil"], "There are two canopies with at least one square one attached to the bed poles.": ["bed poles", "canopies"], "Each image shows a mannequin facing leftward wearing a black graduation robe with stripes on its sleeves, but the mannequin on the left is holding something and the one on the right is not.": ["graduation robe", "mannequin"], "The right and left images each show a two-wheeled cart with one female passenger, and each cart is pulled by one horse and headed in the same direction.": [], "One image contains twice as many colorful birds as the other, and no birds have outstretched wings.": [], "There are five animals [ibex].": ["animals"], "In the right image, a man holding a prize ribbon stands in front of a left-turned dog, with a person behind the dog touching its head and tail.": ["prize ribbon"], "The dog in one of the images has its mouth open.": ["dog"], "in at least one image there is a fully white ferret with white and black whiskers outside in the snow.": ["fully white ferret"], "An animal's teeth are visible.": [], "The left and right image contains the same number of two piece flutes.": ["two piece flutes"], "One image contains two husky puppies reclining side by side, and the other image contains one dog in a standing pose.": ["husky puppies", "standing pose"], "Each dog is wearing something around its neck, and at least one dog is sitting upright.": [], "There is a row of machines standing together against the wall in one of the images.": [], "Each image contains exactly one puppy in a sitting pose, and no puppy is sticking out its tongue.": ["puppy", "sitting pose"], "Both trains in the set of images have the same paint job.": [], "There is one ox pulling a wheeled cart in one of the images.": ["ox"], "Both laptops that are open show the exact same image on the screen.": [], "Exactly one animal is standing on the grass.": [], "There are four birds in the pair of images.": [], "Four pandas are visible.": ["pandas"], "Every shoe is pointing to the right.": [], "There is at least one human present in the image to the left.": [], "The model in the right image wears matching mittens, scarf and pom-pom hat with a distinctive pattern of red stripes around a white stripe.": ["matching mittens", "red stripes"], "The left and right image contains no more than 12 glowing golf balls.": ["glowing golf balls"], "The right image contains two hooved animals - at least one without horns, and the left image contains one hooved animal with curving horns.": ["curving horns", "hooved animal", "hooved animals"], "At least one dog is moving forward outdoors, and exactly one dog is standing still on all fours.": [], "In one image, one person with her head turned rightward is standing behind a non-curved glass display with tiered shelves of baked goods.": ["baked goods", "non-curved glass display", "tiered shelves"], "A person is holding up a leopard in the right image.": ["leopard"], "The right image includes knee pads with red circles on them.": ["knee pads"], "A gerbil with brown fur and a white streak is standing in the corner in the image on the left.": ["gerbil"], "At least some of the zebras in the image on the left are standing on dirt.": ["zebras"], "The right image contains no more than one seal.": [], "There is 1 or more persons actively driving a boat wearing a hat.": [], "The right image shows an afghan hound with a bushy curling tail posed with its prey in front of it.": ["afghan hound", "bushy curling tail"], "There is a single black kneepad in one image and a pair in the other image.": ["single black kneepad"], "The wagons in both pictures are parked in a grassy area.": ["grassy area"], "The left and right image contains the same number of dogs who are both sitting.": ["dogs"], "There are exactly three knee pads.": ["knee pads"], "There are four Guinea pigs in the two images.": ["Guinea pigs"], "In one image, there are five dogs pulling a sled across the snow to the lower right.": [], "The trains in the two images head rightward and have at least two windows on the front.": [], "there is an ox pulling a wooden cart down a road with two people in the cart": ["ox", "wooden cart"], "Both images show stingrays over the sand.": [], "A total of three dogs are shown in the combined images, including one dog sitting upright and alone.": [], "a sitting dog is wearing a collar": ["sitting dog"], "We've got two goats here.": ["goats"], "The left image contains no more than four penguins.": ["penguins"], "There are more than 3 animals on the images.": [], "In one image, there are two baboons.": ["baboons"], "a pair of warthogs are facing each other with noses touching": ["warthogs"], "Three dogs sitting on a rug are all wearing collars in the image on the right.": ["collars", "dogs"], "Some golf balls glow in the dark.": ["golf balls"], "Each image contains a wolf, and one image shows a black wolf and a dark doberman in a face-to-face confrontation.": ["black wolf", "dark doberman"], "There is a total of two pizzas with one in a cardboard box.": ["cardboard box", "pizzas"], "There are only two pizzas visible.": ["pizzas"], "The dog teams in the left and right images are pulling sleds and moving forward over snow in the same direction.": [], "there is a convoy of plow trucks plowing a highway in a row": ["plow trucks"], "There are two large groups of stingrays with no visible people.": ["stingrays"], "Both images show indoor staircases that are not under construction.": ["indoor staircases"], "A person is holding a drum stick.": ["drum stick"], "The hyenas in the right image are facing left.": ["hyenas"], "All the bags are zipped.": [], "There are at least two rodents in the right image.": ["rodents"], "The left and right image contains the same number of still growning broccoli heads.": [], "There is at least one bird perched on a stick or branch.": [], "One image shows a dog team heading straight, away from the camera, with the sled driver not in the scene.": ["dog team", "sled driver"], "The image on the right shows some of the trees surrounding the yurt.": ["yurt"], "A pencil case in the image on the left is open to display its contents.": ["pencil case"], "The combined images include capped bottles, brown glass bottles and cans.": ["brown glass bottles", "cans", "capped bottles"], "Both images show a single husky outside in the snow.": ["single husky"], "In one of the images there is a person using both hands to hold a rifle.": ["rifle"], "There is no more then two items with with labels seen": ["labels"], "One image shows a school bus with its front apparently colliding with another large yellow-and-black vehicle.": ["school bus"], "There are at least five padlocks.": ["padlocks"], "Both doctors are women, and holding syringes.": ["doctors", "women"], "There are children standing by a door.": ["children"], "There are at most three dogs.": ["dogs"], "In two of the images, the unbaked puffed pastry dough is folded and has finger poke marks on top.": ["finger poke marks", "unbaked puffed pastry dough"], "One elephant has long tusks.": ["elephant"], "The right image contains exactly three dogs.": ["dogs"], "The left and right image contains the same number of groundhog with at least one laying down.": ["groundhog"], "No one has both feet flat on the ground.": [], "At least one worlf is showing its teeth.": [], "One image contains easily visible fish.": [], "In the left image the handle of the cup is pointed right.": [], "A dog is leaping outside in the grass.": [], "The left and right image contains a total of two bowls of mashed potatoes with at least one being a casserole dish.": ["casserole dish", "mashed potatoes"], "Both dogs' eyes are open.": [], "In the left image, an adult holding a toddler is standing in frontof a wood rail fence extending a hand with something to eat for a llama on the other side of the fence.": ["llama", "wood rail fence"], "A hand is in the image of the dog on the left, and the right image shows a chihuahua chewing something stick-like.": ["chihuahua"], "Each image shows at least two hands touching a wooden board on a deck.": ["wooden board"], "The chow on the right is standing on an elevated platform with its body turned leftward, and the chow on the left is standing with its body turned rightward and near human legs.": ["elevated platform", "human legs"], "A dog is standing up in the grass in each of the images.": [], "There is only one dog in the water in the left image.": [], "Each image depicts exactly one bird perched on a branch, and the birds in right and left images face the same direction.": [], "Exactly two bowls of mashed potatoes are in round containers, only one with a spoon.": ["mashed potatoes"], "The left image features an orange spaniel with a closed mouth sitting upright and gazing directly at the camera.": ["closed mouth", "orange spaniel"], "There are two beaker with no additional glass pieces attached to it.": ["beaker", "glass"], "There are no more than 4 locks.": ["locks"], "There are at least two baby seals in the images.": ["baby seals"], "there is a single lipstick with a gold tube": [], "The left image contains a large wooden cabinet placed to the left of several wooden chairs.": ["wooden cabinet", "wooden chairs"], "The left image contains twice as many dogs as the right image, and at least one dog in the combined images is standing and at least one dog has blonde hair.": [], "One of the images is from so far away, you can barely see the animals.": ["animals"], "The left and right image contains the same number of flower vases on a table.": ["flower vases"], "An image shows a dark solid-colored beetle with one horn that curls backward.": [], "The left image shows backless 'floating' wooden stairs ascending to the left, with glass panels along the side topped by a wooden handrail.": ["glass panels", "wooden handrail"], "One image shows a gauzy white canopy that drapes the front half of a bed from a cone shape suspended from the ceiling.": ["gauzy white canopy"], "In one of the images a woman is holding at least 1 weight, and in the other image a woman is taking a selfie.": [], "A row of purple chairs is near a ladder in the bookstore image on the left.": ["bookstore image", "purple chairs"], "The left side has more people in the barber shop because there right side has zero people.": ["barber shop"], "There are 4 puppies in the image pair": ["image pair", "puppies"], "The right image shows a mass of vultures milling around in an area with low patchy grass, with no carcass visible.": ["low patchy grass", "vultures"], "the folder on the left is open": [], "Each image shows one rectangular closed pencil case standing upright on its shorter end, and the cases on the left and right are displayed facing the same direction at the same angle.": ["pencil case", "rectangular closed"], "There are exactly two beakers in the right image.": ["beakers"], "One of the pictures has a species that isn't a type of ray.": [], "At least one of the buildings is set up directly on the ground.": [], "The left image shows a blue lid propped on a blue box of 12 yellow golf balls with emoji faces.": ["emoji faces", "yellow golf balls"], "The left and right image contains the same number soap dispensers facing right and forward.": ["soap dispensers"], "Each image contains one syringe with its needle exposed, and one of the images shows a green-bodied syringe.": [], "There are two halves of an orange.": [], "All the shades are partially open.": [], "There are patches of snow in the mountain in the background of several penguins.": ["penguins"], "One image shows two side-by-side windows each with a pair of floor-length bluish printed drapes, in a living room with a pillow-piled couch.": ["living room"], "One image contains exactly three different-sized cylindrical beakers of red, green and blue liquids, displayed overlapping.": [], "One right facing elephant is walking near a wood fence.": ["right facing elephant", "wood fence"], "The golf balls in one of the pictures are arranged in three rows and four columns.": ["golf balls"], "All the products are standing upright.": [], "In at least one image there is a wooden flute with a red tassel near it.": ["red tassel", "wooden flute"], "An image shows one boat with orange-red sail near a row of no more than six white-sailed boats.": [], "The left image contains a dog laying on a wooden floor.": ["dog", "wooden floor"], "One of the pictures shows a doctor holding a syringe on the right.": ["syringe"], "Each image contains only one hyena, and each hyena is standing with its body turned rightward and its face turned toward the camera.": ["hyena"], "One of the images shows a floor with checkerboard tile.": ["checkerboard tile"], "Both soap dispensers have the pumps pointed toward the right.": ["soap dispensers"], "The right image contains a tan car that is parked facing towards the left.": ["tan car"], "The left and right image contains a total of two canopies, one square and one circle.": [], "An image shows five white pear shapes, and at least two are holding flowers.": [], "One image in the pair shows two gorillas and the other shows a single gorilla that is eating.": [], "There are a total of five blinds.": ["blinds"], "Both barbershops have black signs.": ["barbershops"], "One image shows saucer-shaped luminescent jellyfish without long tentacles in an aquarium tank.": ["aquarium tank"], "Both images are taken from the outside of the shop.": [], "In one image, pink flowers are visible in a vase on top of a small dining table": ["dining table", "vase"], "The lipsticks in the left image are shown with their caps next to them.": [], "The right image contains no more than five old fashion styled safety pins.": ["safety pins"], "There are exactly nine wine bottles.": ["wine bottles"], "Three dogs are together outside in the image on the left.": ["dogs"], "Two products are uncovered.": [], "There are plants growing in upright bottles.": [], "The rodent in the image on the right is situated on a piece of pink material.": ["pink"], "In both images a plant is sprouting out of a vase.": ["vase"], "There are at most two dogs.": ["dogs"], "At least one animal is dead on the ground.": [], "In at least one of the images, all four legs of the hyena are shown, and the fact that the shoulders are higher than the haunches can be easily seen.": ["hyena"], "One of the pictures includes a patch of brown rock.": ["brown rock"], "Each image contains just one bird, and at least one image shows a bird perched on a branch.": [], "The right image contains exactly two mountain goats.": ["mountain goats"], "Each image contains one empty bottle with a pump dispenser, and each image features a dispenser nozzle turned leftward.": ["pump dispenser"], "There is at least one dog that has its mouth open.": [], "there are 2 dogs in the image pair": ["dogs", "image pair"], "An image with no more than two items on a surface includes a silver pin with a loop on one end.": ["silver pin"], "The fronts of two women in swimsuits are shown.": ["swimsuits", "women"], "In the foreground of one image, a green canoe moving forward at a right angle is paddled by a person in a red life vest in front, and a person in a blue life vest in back.": ["green canoe"], "An image contains two parrots, and one of them has only red feathers on its head.": ["parrots"], "One image shows two zebra standing facing toward the center, one with its head over the back of the other.": ["zebra"], "The right image has more animals than the left image.": [], "An image shows a workout with only women holding a weight in each hand raised in front of their bodies.": ["women"], "The left and right image contains the same number of sailboat with at least one with no sails out.": ["sailboat"], "the right image has a bracelet made of pins and beads": [], "white painted stripes are painted horizontally on the train engine": ["train engine", "white painted stripes"], "The left and right image contains the same number of canopies with at least one that is pink.": [], "There are two boys riding animals.": ["animals", "boys"], "All crabs are viewed from the top instead of head-on and are positioned with their faces in the front.": ["crabs"], "A covered shelter is behind a bench.": ["covered shelter"], "One of the images shows the wood and glass front door of a white yurt from the outside.": ["white yurt"], "The right image contains a human interacting with a large dog.": [], "Each image features a pump-top dispenser with a square base, and the nozzles on the dispensers in the left and right images face the same general direction.": [], "There are less than 7 bottles and at least one of the bottles has a dropper cap.": ["dropper cap"], "Each image shows a corgi dog in a sitting pose, and the dog on the right has an open mouth while the dog on the left does not.": ["corgi dog", "sitting pose"], "The right image contains exactly two zebras.": ["zebras"], "There is a sliced lemon in both images.": ["sliced"], "In at least one image there are four stories and each roof is painted with goal and topped with a gold circle.": ["gold circle"], "In the image on the left, a cup is spilling its contents onto a laptop.": [], "One of the images features 4 dogs.": ["dogs"], "In one of the images, you will see scenes from a popular video where a pack of wild dogs looses their warthog meal to a crocodile.": ["crocodile", "wild dogs"], "In at least one image there is a white vehicle with tinted window that is not  being driven.": ["tinted window"], "There are exactly two women.": ["women"], "Each image contains one person wearing a hat with one water buffalo, and one image shows a female riding on the water buffalo.": ["water buffalo"], "A bevel-edged item stands upright next to but not touching or overlapping a square box decorated with a rosy ribbon stripe, in one image.": ["rosy ribbon stripe"], "There are three ferrets.": ["ferrets"], "The right image shows a connected bunch of exactly four bananas.": ["bananas"], "Both beds have round top drapes.": ["round top drapes"], "There are two dogs.": ["dogs"], "There is a bottle of lotion that has a picture of citrus fruit depicted on the label.": ["citrus fruit", "lotion"], "One car is black and the other is white, but both convertible cars are parked on pavement and have their tops in the same up-or-down position.": ["convertible cars"], "Left and right images contain stacks of at least three colorful pillows each, and one image shows pillows with bold geometric prints.": ["bold geometric prints", "colorful pillows"], "There are three ibex in the left image.": ["ibex"], "There is at least one white helmet in one of the images.": ["white helmet"], "In both images there is an open case so that the inside is on display.": ["open case"], "The rght image contains exactly one jellyfish, which is upside-down on its mushroom-like cap.": ["jellyfish", "rght image"], "A reddish-orange mama dog has her head next to at least one tiny puppy in the right image.": [], "An entire bracelet is visible in the left image.": [], "there is a mouse on a mousepad next to a keyboard": [], "The combined images include one dog with its open mouth close to another dog's face, and one dog who is looking upward with a smiling open mouth.": [], "Every dog is wearing a collar.": [], "At least one person is wearing a hat.": [], "You will not see any trees in the background.": [], "A dog has its mouth open and is showing its tongue in the rightmost image.": [], "Every single parrot/parakeet is green.": [], "All watercraft shown are riderless and sitting in water.": ["watercraft"], "There are more containers in the image on the left than on the right.": [], "The left and right image contains the same number of painted dogs.": ["painted dogs"], "In one of the images the dog is standing up and in the other it is lying down.": [], "One photograph shoes at least three televisions, while the other shows only one beige colored vintage television with at least one knob for adjustment.": ["beige colored vintage television"], "Exactly one vase has a painted design all over.": [], "One image features a puppy missing its front limbs, and the other image shows two adult dogs with their heads posed one above the other.": ["puppy"], "One image shows no more than five zebras running and kicking up dust, and the other image shows a large herd of zebras running and splashing across a wet green field.": ["zebras"], "In the image on the left, the model is barefoot for certain.": [], "Two dogs are standing in the grass with their tails up.": ["dogs"], "There are three shoes.": [], "One of the nets is pink.": [], "There is at least two dogs in the left image.": ["dogs"], "One image shows a ferret standing on all fours on dirt, with its body in profile and its head turned.": ["ferret"], "One bookstore image shows a staircase to a second floor.": ["bookstore"], "There is a bottle of hot sauce that was previously opened and used.": ["hot sauce"], "There is a crowd of at least 25 kids taking photos.": [], "An image shows one red balloon floating several feet off the ground in a cemetery full of tombstones.": ["tombstones"], "An image shows at least one person standing in a canoe that is horizontal on a body of water.": [], "In at least one image there are at least 10 white homes dug in the the side of a rock facing forward.": [], "There are exactly three bananas in the right image.": ["bananas"], "One image contains a single whole orange and one half orange.": [], "At least one of the bottles has a kind of loop on the lid, and the bottles on the left and right are different styles.": [], "All the animals are standing.": ["animals"], "An elephant is facing right in at least one image.": ["elephant"], "One image contains two stacks of towels, and all towels are different solid colors and shades of colors.": ["solid colors"], "At least one bus has its passenger door open.": [], "At least one of the water bottles is a sky blue color.": ["water bottles"], "There is one leather binder with paper in it that is open.": ["leather binder"], "A dog is wearing clothing in only one image.": ["dog"], "There are two glasses in the left image and one in the right image.": [], "There are three pandas.": ["pandas"]}